{
    "archive": [{
        "service_name": "Auto Scaling (N. Virginia)",
        "summary": "[RESOLVED] Increased API Error Rates",
        "date": "1525914401",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 6:06 PM PDT</span>&nbsp;We are investigating increased API error rates in the US-EAST-1 Region.</div><div><span class=\"yellowfg\"> 6:26 PM PDT</span>&nbsp;We are continuing to investigate increased API error rates in the US-EAST-1 Region</div><div><span class=\"yellowfg\"> 7:24 PM PDT</span>&nbsp;We have identified the root cause of the elevated API error rates and can confirm that most customers have recovered. We are continuing to work towards full resolution.</div><div><span class=\"yellowfg\"> 7:40 PM PDT</span>&nbsp;Between 5:42 PM and 7:04 PM PDT, we experienced increased API error rates in the US-EAST-1 Region. The issue has been resolved and the service is operating normally.</div>",
        "service": "autoscaling-us-east-1"
    }, {
        "service_name": "Amazon Elastic Compute Cloud (N. Virginia)",
        "summary": "[RESOLVED] Delayed network provisioning",
        "date": "1526397141",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 8:12 AM PDT</span>&nbsp;We are investigating delayed network provisioning for newly launched instances in a single Availability Zone in the US-EAST-1 Region.</div><div><span class=\"yellowfg\"> 8:45 AM PDT</span>&nbsp;Between 5:27 AM and 8:17 AM PDT we experienced delayed network provisioning for newly launched instances in a single Availability Zone in the US-EAST-1 Region. The issue have been resolved and the service is operating normally. </div>",
        "service": "ec2-us-east-1"
    }, {
        "service_name": "Amazon Elastic Load Balancing (N. Virginia)",
        "summary": "[RESOLVED] Increased provisioning times",
        "date": "1526397279",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 8:14 AM PDT</span>&nbsp;We are investigating increased provisioning times for load balancers in the US-EAST-1 Region. Registration of back-end instances and connectivity to existing instances are not affected. </div><div><span class=\"yellowfg\"> 8:53 AM PDT</span>&nbsp;Between 6:05 AM and 8:17 AM PDT we experienced delayed network provisioning for newly launched instances in a single Availability Zone in the US-EAST-1 Region. Registration of back-end instances and connectivity to existing instances are not affected. The issue have been resolved and the service is operating normally. </div>",
        "service": "elb-us-east-1"
    }, {
        "service_name": "Amazon Elastic MapReduce (N. Virginia)",
        "summary": "[RESOLVED] Delays in starting clusters",
        "date": "1526397532",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 8:19 AM PDT</span>&nbsp;We are investigating delays in starting Amazon EMR clusters in the US-EAST-1 Region. Existing clusters are not impacted.</div><div><span class=\"yellowfg\"> 8:40 AM PDT</span>&nbsp;Between 7:00 AM and 8:15 AM PDT we experienced delays in starting Amazon EMR clusters in the US-EAST-1 Region. Existing clusters were not impacted. The issue has been resolved and the service is operating normally.</div>",
        "service": "emr-us-east-1"
    }, {
        "service_name": "Amazon Simple Storage Service (N. Virginia)",
        "summary": "[RESOLVED] Elevated error rates",
        "date": "1526466746",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 3:32 AM PDT</span>&nbsp;Between 2:35 AM and 2:39 AM PDT, we experienced elevated error rates for requests in the US-EAST-1 Region. The issue has been resolved and the service is operating normally.</div>",
        "service": "s3-us-standard"
    }, {
        "service_name": "AWS CodeBuild (N. Virginia)",
        "summary": "[RESOLVED] Increased build error rates",
        "date": "1526469181",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 4:13 AM PDT</span>&nbsp;We are investigating increased Build error rates in US-EAST-1 Region. </div><div><span class=\"yellowfg\"> 5:12 AM PDT</span>&nbsp;Between 2:50 AM and 4:55 AM PDT, we experienced elevated Build error rates in the US-EAST-1 Region. The issue has been resolved and the service is operating normally.</div>",
        "service": "codebuild-us-east-1"
    }, {
        "service_name": "Amazon AppStream 2.0 (N. Virginia)",
        "summary": "[RESOLVED] Increased error rates",
        "date": "1526472913",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 5:15 AM PDT</span>&nbsp;We are currently investigating increased error rates in provisioning streaming instances in the US-EAST-1 Region.</div><div><span class=\"yellowfg\"> 5:22 AM PDT</span>&nbsp;Between 2:50 AM and 5:06 AM PDT, we experienced increased error rates in provisioning streaming instances. The issue has been resolved now and the service is operating normally.</div>",
        "service": "appstream2-us-east-1"
    }, {
        "service_name": "AWS Systems Manager (N. Virginia)",
        "summary": "[RESOLVED] Increased error rates",
        "date": "1526473109",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 5:18 AM PDT</span>&nbsp;Between 2:50 AM and 4:55 AM PDT we experienced increased API error rates in the US-EAST-1 Region. The issue has been resolved and the service is operating normally.</div>",
        "service": "ec2systemsmanager-us-east-1"
    }, {
        "service_name": "Amazon Elastic Compute Cloud (Sao Paulo)",
        "summary": "[RESOLVED] Network Connectivity",
        "date": "1526569732",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 8:09 AM PDT</span>&nbsp;We are investigating connectivity issues for some instances in the SA-EAST-1 Region.</div><div><span class=\"yellowfg\"> 8:32 AM PDT</span>&nbsp; Between 7:26 AM and 7:34 AM PDT, and between 7:57 AM to 8:05 AM PDT, some instances experienced connectivity issues in the SA-EAST-1 Region. The issue has been resolved and the service is operating normally.</div>",
        "service": "ec2-sa-east-1"
    }, {
        "service_name": "Amazon WorkMail (N. Virginia)",
        "summary": "[RESOLVED] Increased Outlook Sync Latencies and Errors",
        "date": "1527016380",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\">12:13 PM PDT</span>&nbsp;We are investigating increased WorkMail Outlook synchronization latencies and error rates in the US-EAST-1 Region impacting the sending and receiving of new messages or appointments in Outlook clients.</div><div><span class=\"yellowfg\">12:30 PM PDT</span>&nbsp;Between 11:06 AM and 12:09 PM PDT we experienced increased WorkMail Outlook synchronization latencies and error rates in the US-EAST-1 Region, impacting the sending and receiving of new messages or appointments in Outlook clients. The issue has been resolved and the service is operating normally.</div>",
        "service": "workmail-us-east-1"
    }, {
        "service_name": "Amazon Cognito (N. Virginia)",
        "summary": "[RESOLVED] Elevated Sign In Error Rates",
        "date": "1527647488",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 7:31 PM PDT</span>&nbsp;We are investigating reports that some users are unable to sign in or sign up to applications using Facebook identities with Amazon Cognito User Pools.</div><div><span class=\"yellowfg\"> 8:17 PM PDT</span>&nbsp;Recently, some users were unable to sign in or sign up to applications using Facebook identities with Amazon Cognito User Pools. The issue has been resolved and the service is operating normally.</div>",
        "service": "cognito-us-east-1"
    }, {
        "service_name": "Amazon Elastic Compute Cloud (Ohio)",
        "summary": "[RESOLVED] Internet Connectivity",
        "date": "1527752189",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\">12:36 AM PDT</span>&nbsp;We are currently investigating connectivity issues in the US-EAST-2 Region.</div><div><span class=\"yellowfg\"> 1:01 AM PDT</span>&nbsp;Between 12:11 AM and 12:45 AM PDT we experienced impaired Internet connectivity in the US-EAST-2 Region. The issue has been resolved and the service is operating normally.</div>",
        "service": "ec2-us-east-2"
    }, {
        "service_name": "AWS Internet Connectivity (Ohio)",
        "summary": "[RESOLVED] Internet Connectivity",
        "date": "1527752941",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\">12:49 AM PDT</span>&nbsp;\r\nWe are currently investigating connectivity issues in the US-EAST-2 Region. </div><div><span class=\"yellowfg\">12:59 AM PDT</span>&nbsp;Between 12:11 AM and 12:45 AM PDT we experienced impaired Internet connectivity in the US-EAST-2 Region. The issue has been resolved and the service is operating normally.</div>",
        "service": "internetconnectivity-us-east-2"
    }, {
        "service_name": "Amazon Elastic File System (Oregon)",
        "summary": "[RESOLVED] Increased Error Rates",
        "date": "1527800578",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 2:03 PM PDT</span>&nbsp;We are investigating increased error rates for file system requests in the US-WEST-2 Region.</div><div><span class=\"yellowfg\"> 2:58 PM PDT</span>&nbsp;Between 1:00 PM and 2:29 PM PDT, we experienced increased error rates for file system read/write requests in the US-WEST-2 Region. The issue has been resolved and the service is operating normally.</div>",
        "service": "elasticfilesystem-us-west-2"
    }, {
        "service_name": "Amazon Elastic Compute Cloud (N. Virginia)",
        "summary": "[RESOLVED] Instance Connectivity Issues",
        "date": "1527804823",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 3:13 PM PDT</span>&nbsp;We are investigating connectivity issues affecting some instances in a single Availability Zone in the US-EAST-1 Region.\r\n</div><div><span class=\"yellowfg\"> 3:42 PM PDT</span>&nbsp;We can confirm that there has been an issue in one of the datacenters that makes up one of US-EAST-1 Availability Zones. This was a result of a power event impacting a small percentage of the physical servers in that datacenter as well as some of the networking devices. Customers with EC2 instances in this availability zone may see issues with connectivity to the affected instances. We are seeing recovery and continue to work toward full resolution.</div><div><span class=\"yellowfg\"> 4:29 PM PDT</span>&nbsp;We have restored power to the vast majority of the affected instances and continue to work towards full recovery.</div><div><span class=\"yellowfg\"> 5:36 PM PDT</span>&nbsp;ï»¿ï»¿Beginning at 2:52 PM PDT a small percentage of EC2 servers lost power in a single Availability Zone in the US-EAST-1 Region. This resulted in some impaired EC2 instances and degraded performance for some EBS volumes in the affected Availability Zone. Power was restored at 3:22 PM PDT, at which point the vast majority of instances and volumes saw recovery. We have been working to recover the remaining instances and volumes. The small number of remaining instances and volumes are hosted on hardware which was adversely affected by the loss of power. While we will continue to work to recover all affected instances and volumes, for immediate recovery, we recommend replacing any remaining affected instances or volumes if possible.</div>",
        "service": "ec2-us-east-1"
    }, {
        "service_name": "Amazon Redshift (N. Virginia)",
        "summary": "[RESOLVED] Connectivity Issues",
        "date": "1527806609",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 3:43 PM PDT</span>&nbsp;We are investigating connectivity issues affecting some Redshift clusters in a single Availability Zone in the US-EAST-1 Region.</div><div><span class=\"yellowfg\"> 4:07 PM PDT</span>&nbsp;Between 2:52 PM and 3:55 PM PDT we experienced connectivity issues affecting some clusters in a single Availability Zone in the US-EAST-1 Region. The issue has been resolved and the service is operating normally. </div>",
        "service": "redshift-us-east-1"
    }, {
        "service_name": "Amazon WorkSpaces (N. Virginia)",
        "summary": "[RESOLVED] Connectivity Issues",
        "date": "1527806975",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 3:49 PM PDT</span>&nbsp;We are investigating elevated error rates for connections to some WorkSpaces in a single Availability Zone in the US-EAST-1 Region.\r\n</div><div><span class=\"yellowfg\"> 4:18 PM PDT</span>&nbsp;Between 2:52 PM and 4:15 PM PDT we experienced increased error rates for connections to some WorkSpaces in a single Availability Zone in the US-EAST-1 Region. The issue has been resolved and the service is operating normally.</div>",
        "service": "workspaces-us-east-1"
    }, {
        "service_name": "Amazon Relational Database Service (N. Virginia)",
        "summary": "[RESOLVED] Connectivity Issues",
        "date": "1527807509",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 3:58 PM PDT</span>&nbsp;We are investigating connectivity issues affecting some database instances in a single Availability Zone in the US-EAST-1 Region.</div><div><span class=\"yellowfg\"> 4:12 PM PDT</span>&nbsp;Beginning at 2:52 PM PDT, we experienced connectivity issues affecting some database instances in a single Availability Zone in the US-EAST-1 Region. Multi-AZ database instances functioned correctly and remain available. A small number of Single-AZ database instances remain unavailable and we are working to resolve the issue.</div><div><span class=\"yellowfg\"> 5:42 PM PDT</span>&nbsp;Beginning at 2:52 PM PDT, we experienced connectivity issues affecting some database instances in a single Availability Zone in the US-EAST-1 Region. Multi-AZ database instances functioned correctly and remained available. Connectivity was restored at 3:22 PM PDT, at which point the vast majority of database instances recovered. A small number of Single-AZ database instances remain unavailable and we are continuing to work to recover all affected database instances.</div>",
        "service": "rds-us-east-1"
    }, {
        "service_name": "Amazon Route 53",
        "summary": "[RESOLVED] Increased Propagation Time",
        "date": "1528291058",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 6:17 AM PDT</span>&nbsp;We are investigating increased propagation times of DNS edits to the Route 53 DNS servers. This does not impact queries to existing DNS records.</div><div><span class=\"yellowfg\"> 6:47 AM PDT</span>&nbsp;Between 5:42 AM and 6:45 AM PDT, we experienced increased propagation times of DNS edits to the Route 53 DNS servers. This did not impact queries to existing DNS records. The issue has been resolved and the service is operating normally.</div>",
        "service": "route53"
    }, {
        "service_name": "Auto Scaling (N. Virginia)",
        "summary": "[RESOLVED] Increased API Error Rates",
        "date": "1528330928",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 5:22 PM PDT</span>&nbsp;We are investigating increased error rates for API calls in the US-EAST-1 Region.</div><div><span class=\"yellowfg\"> 5:33 PM PDT</span>&nbsp;Between 5:05 PM and 5:26 PM PDT we experienced increased error rates for API calls in the US-EAST-1 Region. The issue has been resolved and the service is operating normally.</div>",
        "service": "autoscaling-us-east-1"
    }, {
        "service_name": "Amazon CloudFront",
        "summary": "[RESOLVED] Delays in propagating certain configuration changes to a few CloudFront Edge locations ",
        "date": "1528895774",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 6:16 AM PDT</span>&nbsp;We are investigating longer than usual propagation times to propagate certain configuration changes to a few of our edge locations: the creation and deletion of CloudFront distributions and the updating of certificates for a CloudFront distribution. All other CloudFront configuration changes are propagating normally. End-user requests for content from our edge locations are not affected by this issue and are being served normally. </div><div><span class=\"yellowfg\"> 6:59 AM PDT</span>&nbsp;Between 3:25 AM and 6:45 AM PDT, CloudFront experienced longer than usual propagation times to propagate certain configuration changes to a few of our edge locations. This issue has been resolved and the service is operating normally. During this time, end user requests for content from our edge locations were not affected by this issue and were being served normally.</div>",
        "service": "cloudfront"
    }, {
        "service_name": "Amazon Elastic Load Balancing (N. Virginia)",
        "summary": "[RESOLVED] Increased API Error Rates ",
        "date": "1528907930",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 9:39 AM PDT</span>&nbsp;We are investigating increased error rates and latencies for ELB APIs in the US-EAST-1 Region. Traffic to existing load balancers is not affected.</div><div><span class=\"yellowfg\">10:11 AM PDT</span>&nbsp;Between 8:59 AM and 9:58 AM PDT we experienced increased error rates and latencies for the ELB APIs in the US-EAST-1 Region. The issue affected load balancer provisioning and target registration for Application and Network Load Balancer. Classic Load Balancer, as well as traffic to all existing load balancers, was not affected. The issue has been resolved and the service is operating normally. </div>",
        "service": "elb-us-east-1"
    }, {
        "service_name": "AWS CodeDeploy (N. Virginia)",
        "summary": "[RESOLVED] Elevated API Error Rates",
        "date": "1529347567",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\">11:46 AM PDT</span>&nbsp;We are investigating elevated error rates for APIs in the US-EAST-1 Region.</div><div><span class=\"yellowfg\">12:31 PM PDT</span>&nbsp;Between 11:11 AM and 12:00 PM PDT we experienced elevated error rates for APIs in the US-EAST-1 Region. The issue has been resolved and the service is operating normally. </div>",
        "service": "codedeploy-us-east-1"
    }, {
        "service_name": "AWS Cloud9 (N. Virginia)",
        "summary": "[RESOLVED] Increased API Error Rates",
        "date": "1529609394",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\">12:30 PM PDT</span>&nbsp;Between 11:01 AM and 11:20 AM PDT we experienced increased error rates in creating and accessing Cloud9 environments in the US-EAST-1 Region. The issue has been resolved and the service is operating normally. </div>",
        "service": "cloud9-us-east-1"
    }, {
        "service_name": "AWS Identity and Access Management",
        "summary": "[RESOLVED] Increased Error Rates and Latencies",
        "date": "1529622992",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 4:16 PM PDT</span>&nbsp;We are investigating increased error rates and latencies for the IAM APIs.</div><div><span class=\"yellowfg\"> 4:24 PM PDT</span>&nbsp;Between 3:38 PM and 4:11 PM PDT we experienced increased IAM API error rates and latencies. The issue has been resolved and the service is operating normally.</div>",
        "service": "iam"
    }, {
        "service_name": "Amazon Elastic File System (N. Virginia)",
        "summary": "[RESOLVED] Increased API Error Rates",
        "date": "1530065273",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 7:08 PM PDT</span>&nbsp;Between 5:14 PM and 6:09 PM PDT, we experienced increased error rates for API requests in the US-EAST-1 Region. The issue has been resolved and the service is now operating normally.</div>",
        "service": "elasticfilesystem-us-east-1"
    }, {
        "service_name": "AWS IoT Core (N. Virginia)",
        "summary": "[RESOLVED] Increased Error Rates",
        "date": "1530296421",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\">11:20 AM PDT</span>&nbsp;We are investigating increased error rates for connections to AWS IoT Core, affecting some customers in the US-EAST-1 Region. </div><div><span class=\"yellowfg\">11:38 AM PDT</span>&nbsp;We continue to investigate increased error rates for connections to AWS IoT Core, affecting some customers in the US-EAST-1 Region. </div><div><span class=\"yellowfg\">12:02 PM PDT</span>&nbsp;Error rates for connections to AWS IoT Core in the US-EAST-1 Region are improving. We continue to work towards full resolution. </div><div><span class=\"yellowfg\">12:44 PM PDT</span>&nbsp;Between 9:26 AM and 11:56 AM PDT we experienced intermittent elevated error rates for connections to AWS IoT Core in the US-EAST-1 Region. The issue has been resolved and the service is operating normally. </div>",
        "service": "awsiot-us-east-1"
    }, {
        "service_name": "Amazon Chime",
        "summary": "[RESOLVED] Availability",
        "date": "1530900123",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\">11:02 AM PDT</span>&nbsp;We are investigating meeting availability issues in the US-EAST-1 Region.</div><div><span class=\"yellowfg\">11:18 AM PDT</span>&nbsp;We continue to investigate meeting availability issues in the US-EAST-1 Region. </div><div><span class=\"yellowfg\">11:49 AM PDT</span>&nbsp;Between 10:24 AM PDT and 11:31 AM PDT, we experienced meeting availability issues in the US-EAST-1 Region. The issue has been resolved and the service is operating normally. </div>",
        "service": "chime"
    }, {
        "service_name": "Amazon Route 53",
        "summary": "[RESOLVED] Increased Propagation Time",
        "date": "1531395752",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 4:44 AM PDT</span>&nbsp;We are investigating increased propagation times of DNS edits to the Route 53 DNS servers. This does not impact queries to existing DNS records.</div><div><span class=\"yellowfg\"> 5:15 AM PDT</span>&nbsp;We can confirm increased propagation times of DNS edits to the Route 53 DNS servers and continue to work towards resolution. This does not impact queries to existing DNS records.</div><div><span class=\"yellowfg\"> 6:02 AM PDT</span>&nbsp;Propagation of DNS edits for Route 53 records in Public Hosted Zones has recovered. We are still working towards recovery for DNS edits for records in Route 53 Private Hosted Zones.</div><div><span class=\"yellowfg\"> 6:24 AM PDT</span>&nbsp;Between 4:00 AM and 6:14 AM PDT we experienced increased propagation times of DNS edits to a single Route 53 edge location. This does not impact queries to existing DNS records. The issue has been resolved and the service is operating normally.</div>",
        "service": "route53"
    }, {
        "service_name": "AWS Management Console",
        "summary": "[RESOLVED] Increased Error Rates",
        "date": "1531774261",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 1:51 PM PDT</span>&nbsp;We are currently experiencing intermittent errors accessing the AWS Management Console. AWS services are operating normally.</div><div><span class=\"yellowfg\"> 2:10 PM PDT</span>&nbsp;We are currently experiencing intermittent errors accessing the AWS Management Console when using root account login credentials. The underlying AWS services and console logins using IAM users are operating normally.</div><div><span class=\"yellowfg\"> 2:47 PM PDT</span>&nbsp;We have identified the root cause for the intermittent errors accessing the AWS Management Console when using root account login credentials. We are beginning to see recovery, and continue to work toward full resolution. The underlying AWS services and console logins using IAM users continue to operate normally.</div><div><span class=\"yellowfg\"> 3:44 PM PDT</span>&nbsp;Between 12:28 PM and 3:13 PM PDT we experienced intermittent errors accessing the AWS Management Console. AWS services were not affected by this event. This issue has been resolved and the service is operating normally.</div>",
        "service": "management-console"
    }, {
        "service_name": "Amazon Elastic Compute Cloud (Frankfurt)",
        "summary": "[RESOLVED] Network Connectivity",
        "date": "1531962885",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 6:14 PM PDT</span>&nbsp;We are investigating connectivity issues to a single Availability Zone in the EU-CENTRAL-1 Region.</div><div><span class=\"yellowfg\"> 6:34 PM PDT</span>&nbsp;Between 5:39 PM and 5:49 PM PDT we experienced network connectivity issues for some instances in a single Availability Zone in the EU-CENTRAL-1 Region. The issue has been resolved and the service is operating normally.</div>",
        "service": "ec2-eu-central-1"
    }, {
        "service_name": "Amazon Simple Queue Service (Tokyo)",
        "summary": "[è§£æ±ºæ¸ˆã¿]SQSã§ã®ã‚³ãƒã‚¯ã‚·ãƒ§ãƒ³ãƒªã‚»ãƒƒãƒˆåŠã³ã‚½ã‚±ãƒƒãƒˆã‚¿ã‚¤ãƒ ã‚¢ã‚¦ãƒˆã®ç™ºç”Ÿ | [RESOLVED] Connection reset and socket timeout for SQS ",
        "date": "1533208334",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 4:12 AM PDT</span>&nbsp;æ—¥æœ¬æ™‚é–“ 2018/08/02 17:30 ã‹ã‚‰ 17:55 ã«ã‹ã‘ã¦ã€æ±äº¬ãƒªãƒ¼ã‚¸ãƒ§ãƒ³ã® SQS ã«ãŠã„ã¦ã‚³ãƒã‚¯ã‚·ãƒ§ãƒ³ãƒªã‚»ãƒƒãƒˆåŠã³ã‚½ã‚±ãƒƒãƒˆã‚¿ã‚¤ãƒ ã‚¢ã‚¦ãƒˆã®ç™ºç”ŸçŽ‡ãŒä¸Šæ˜‡ã—ã¾ã—ãŸã€‚å•é¡Œã¯æ—¢ã«è§£æ¶ˆã—ã€ç¾åœ¨ã‚µãƒ¼ãƒ“ã‚¹ã¯æ­£å¸¸ã«ç¨¼åƒã—ã¦ãŠã‚Šã¾ã™ã€‚| Between 1:30AM and 1:55 AM PDT we experienced connection resets and socket timeout rates in the AP-NORTHEAST-1 Region. The issue has been resolved and the service is operating normally. </div><div><span class=\"yellowfg\"> 4:22 AM PDT</span>&nbsp;æ—¥æœ¬æ™‚é–“ 2018/08/02 17:30 ã‹ã‚‰ 17:55 ã«ã‹ã‘ã¦ã€æ±äº¬ãƒªãƒ¼ã‚¸ãƒ§ãƒ³ã® SQS ã«ãŠã„ã¦ã‚³ãƒã‚¯ã‚·ãƒ§ãƒ³ãƒªã‚»ãƒƒãƒˆåŠã³ã‚½ã‚±ãƒƒãƒˆã‚¿ã‚¤ãƒ ã‚¢ã‚¦ãƒˆã®ç™ºç”ŸçŽ‡ãŒä¸Šæ˜‡ã—ã¾ã—ãŸã€‚å•é¡Œã¯æ—¢ã«è§£æ¶ˆã—ã€ç¾åœ¨ã‚µãƒ¼ãƒ“ã‚¹ã¯æ­£å¸¸ã«ç¨¼åƒã—ã¦ãŠã‚Šã¾ã™ã€‚| Between 1:30AM and 1:55 AM PDT we experienced connection resets and socket timeout rates in the AP-NORTHEAST-1 Region. The issue has been resolved and the service is operating normally.</div>",
        "service": "sqs-ap-northeast-1"
    }, {
        "service_name": "Amazon Route 53",
        "summary": "[RESOLVED]  Increased Console and API error rates",
        "date": "1533545240",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 1:47 AM PDT</span>&nbsp;Between 12:49 AM and 1:04 AM PDT customers using the Route 53 console and API experienced an elevated error rate. The issue has been resolved and both the Route 53 console and API are operating normally. Route 53 DNS and health checks were both operating normally during this time.</div>",
        "service": "route53"
    }, {
        "service_name": "Amazon Elastic Compute Cloud (N. Virginia)",
        "summary": "[RESOLVED] Instance launch errors and connectivity issues",
        "date": "1533674185",
        "status": 0,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 1:49 PM PDT</span>&nbsp;Between 1:06 PM and 1:33 PM PDT we experienced increased error rates for new instance launches and intermittent network connectivity issues for some running instances in a single Availability Zone in the US-EAST-1 Region. The issue has been resolved and the service is operating normally</div>",
        "service": "ec2-us-east-1"
    }, {
        "service_name": "Amazon Simple Notification Service (Tokyo)",
        "summary": "[RESOLVED] SNSã®ã‚¨ãƒ©ãƒ¼ãƒ¬ãƒ¼ãƒˆä¸Šæ˜‡ã«ã¤ã„ã¦ | Elevated error rates for SNS",
        "date": "1533695504",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 7:31 PM PDT</span>&nbsp;æ±äº¬ãƒªãƒ¼ã‚¸ãƒ§ãƒ³ã«ãŠãã¾ã—ã¦ã€ç¾åœ¨SNS Publish APIã®ã‚¨ãƒ©ãƒ¼ãƒ¬ãƒ¼ãƒˆãŒä¸Šæ˜‡ã—ã¦ãŠã‚Šã€åŽŸå› ã‚’èª¿æŸ»ã—ã¦ãŠã‚Šã¾ã™ã€‚| We are currently investigating elevated error rates for the SNS Publish API in the AP-NORTHEAST-1 Region.</div><div><span class=\"yellowfg\"> 8:34 PM PDT</span>&nbsp;æ±äº¬ãƒªãƒ¼ã‚¸ãƒ§ãƒ³ã«ãŠãã¾ã—ã¦ã€æ—¥æœ¬æ™‚é–“ 2018å¹´8æœˆ8æ—¥ 10:47-12:08ã®é–“ã€SNS Publish APIã®ã‚¨ãƒ©ãƒ¼ãƒ¬ãƒ¼ãƒˆãŒä¸Šæ˜‡ã—ã¦ãŠã‚Šã¾ã—ãŸã€‚äº‹è±¡ã¯å¾©æ—§ã—ã€ã‚µãƒ¼ãƒ“ã‚¹ã¯æ­£å¸¸ã«ç¨¼åƒã—ã¦ãŠã‚Šã¾ã™ã€‚| Between 6:47 PM and 8:08 PM PDT we experienced elevated error rates for the SNS Publish API in the AP-NORTHEAST-1 Region. The issue has been resolved and the service is operating normally. </div>",
        "service": "sns-ap-northeast-1"
    }, {
        "service_name": "AWS Management Console",
        "summary": "[RESOLVED] ã‚¨ãƒ©ãƒ¼ãƒ¬ãƒ¼ãƒˆã®ä¸Šæ˜‡ã«ã¤ã„ã¦ | Elevated Error Rates",
        "date": "1533696595",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 7:50 PM PDT</span>&nbsp;æ±äº¬ãƒªãƒ¼ã‚¸ãƒ§ãƒ³ã«ãŠãã¾ã—ã¦ã€AWS ãƒžãƒã‚¸ãƒ¡ãƒ³ãƒˆã‚³ãƒ³ã‚½ãƒ¼ãƒ«ã®ã‚¨ãƒ©ãƒ¼ãƒ¬ãƒ¼ãƒˆãŒä¸Šæ˜‡ã—ã¦ãŠã‚Šã€åŽŸå› ã‚’èª¿æŸ»ã—ã¦ãŠã‚Šã¾ã™ã€‚| We are investigating elevated error rates for the AWS Management Console in the AP-NORTHEAST-1 Region.</div><div><span class=\"yellowfg\"> 8:26 PM PDT</span>&nbsp;æ±äº¬ãƒªãƒ¼ã‚¸ãƒ§ãƒ³ã«ãŠãã¾ã—ã¦ã€æ—¥æœ¬æ™‚é–“ 2018å¹´8æœˆ8æ—¥ 10:47-12:08ã«ã‹ã‘ã¦ AWS ãƒžãƒãƒ¼ã‚¸ãƒ¡ãƒ³ãƒˆã‚³ãƒ³ã‚½ãƒ¼ãƒ«ã®ã‚¨ãƒ©ãƒ¼ãƒ¬ãƒ¼ãƒˆãŒä¸Šæ˜‡ã—ã¦ãŠã‚Šã¾ã—ãŸã€‚äº‹è±¡ã¯å¾©æ—§ã—ã€ã‚³ãƒ³ã‚½ãƒ¼ãƒ«ã¯æ­£å¸¸ã«ç¨¼åƒã—ã¦ãŠã‚Šã¾ã™ã€‚| Between 6:47 PM and 8:08 PM PDT, users experienced elevated error rates for the AWS Management Console in the AP-NORTHEAST-1 Region. The issue has been resolved and the Console is operating normally. </div>",
        "service": "management-console"
    }, {
        "service_name": "Amazon Elastic MapReduce (Mumbai)",
        "summary": "[RESOLVED] Failures in starting clusters",
        "date": "1533722524",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 3:02 AM PDT</span>&nbsp;We are investigating increased error rates impacting start up of clusters operations in the AP-SOUTH-1 Region.</div><div><span class=\"yellowfg\"> 4:13 AM PDT</span>&nbsp;Between 5:10 PM on August 7th, and 3:50 AM PDT on August 8th, we experienced increased error rates in starting clusters in the AP-SOUTH-1 Region. The issue has been resolved and the service is operating normally.</div>",
        "service": "emr-ap-south-1"
    }, {
        "service_name": "Amazon Elastic MapReduce (Paris)",
        "summary": "[RESOLVED] Failures in starting clusters",
        "date": "1533722689",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 3:05 AM PDT</span>&nbsp;We are investigating increased error rates impacting start up of clusters operations in the EU-WEST-3 Region.</div><div><span class=\"yellowfg\"> 4:16 AM PDT</span>&nbsp;Between 5:10 PM on August 7th, and 3:50 AM PDT on August 8th, we experienced increased error rates in starting clusters in the EU-WEST-3 Region. The issue has been resolved and the service is operating normally.</div>",
        "service": "emr-eu-west-3"
    }, {
        "service_name": "Amazon Elastic MapReduce (Ohio)",
        "summary": "[RESOLVED] Failures in starting clusters",
        "date": "1533722825",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 3:07 AM PDT</span>&nbsp;We are investigating increased error rates impacting start up of clusters operations in the US-EAST-2 Region.</div><div><span class=\"yellowfg\"> 4:18 AM PDT</span>&nbsp;Between 5:10 PM on August 7th, and 3:50 AM PDT on August 8th, we experienced increased error rates in starting clusters in the US-EAST-2 Region. The issue has been resolved and the service is operating normally.</div>",
        "service": "emr-us-east-2"
    }, {
        "service_name": "Amazon Elastic MapReduce (N. Virginia)",
        "summary": "[RESOLVED] Failures in starting clusters",
        "date": "1533722962",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 3:09 AM PDT</span>&nbsp;We are investigating increased error rates impacting start up of clusters operations in the US-EAST-1 Region.</div><div><span class=\"yellowfg\"> 4:19 AM PDT</span>&nbsp;Between 5:10 PM on August 7th, and 3:50 AM PDT on August 8th, we experienced increased error rates in starting clusters in the US-EAST-1 Region. The issue has been resolved and the service is operating normally.</div>",
        "service": "emr-us-east-1"
    }, {
        "service_name": "Amazon Elastic MapReduce (Ireland)",
        "summary": "[RESOLVED] Failures in starting clusters",
        "date": "1533723112",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 3:12 AM PDT</span>&nbsp;We are investigating increased error rates impacting start up of clusters operations in the EU-WEST-1 Region.</div><div><span class=\"yellowfg\"> 4:21 AM PDT</span>&nbsp;Between 5:10 PM on August 7th, and 3:50 AM PDT on August 8th, we experienced increased error rates in starting clusters in the EU-WEST-1 Region. The issue has been resolved and the service is operating normally.</div>",
        "service": "emr-eu-west-1"
    }, {
        "service_name": "Amazon Elastic MapReduce (Frankfurt)",
        "summary": "[RESOLVED] Failures in starting clusters",
        "date": "1533723257",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 3:14 AM PDT</span>&nbsp;We are investigating increased error rates impacting start up of clusters operations in the EU-CENTRAL-1 Region</div><div><span class=\"yellowfg\"> 4:23 AM PDT</span>&nbsp;Between 5:10 PM on August 7th, and 3:50 AM PDT on August 8th, we experienced increased error rates in starting clusters in the EU-CENTRAL-1 Region. The issue has been resolved and the service is operating normally.</div>",
        "service": "emr-eu-central-1"
    }, {
        "service_name": "Amazon Elastic MapReduce (N. California)",
        "summary": "[RESOLVED] Failures in starting clusters",
        "date": "1533723374",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 3:16 AM PDT</span>&nbsp;We are investigating increased error rates impacting start up of clusters operations in the US-WEST-1 Region.</div><div><span class=\"yellowfg\"> 4:26 AM PDT</span>&nbsp;Between 5:10 PM on August 7th, and 3:50 AM PDT on August 8th, we experienced increased error rates in starting clusters in the US-WEST-1 Region. The issue has been resolved and the service is operating normally.</div>",
        "service": "emr-us-west-1"
    }, {
        "service_name": "Amazon Elastic MapReduce (Singapore)",
        "summary": "[RESOLVED] Failures in starting clusters",
        "date": "1533723484",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 3:18 AM PDT</span>&nbsp;We are investigating increased error rates impacting start up of clusters operations in the AP-SOUTHEAST-1 Region.</div><div><span class=\"yellowfg\"> 4:29 AM PDT</span>&nbsp;Between 5:10 PM on August 7th, and 3:50 AM PDT on August 8th, we experienced increased error rates in starting clusters in the AP-SOUTHEAST-1 Region. The issue has been resolved and the service is operating normally.</div>",
        "service": "emr-ap-southeast-1"
    }, {
        "service_name": "Amazon Elastic MapReduce (Sydney)",
        "summary": "[RESOLVED] Failures in starting clusters",
        "date": "1533723818",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 3:23 AM PDT</span>&nbsp;We are investigating increased error rates impacting start up of clusters operations in the AP-SOUTHEAST-2 Region.</div><div><span class=\"yellowfg\"> 4:31 AM PDT</span>&nbsp;Between 5:10 PM on August 7th, and 3:50 AM PDT on August 8th, we experienced increased error rates in starting clusters in the AP-SOUTHEAST-2 Region. The issue has been resolved and the service is operating normally.</div>",
        "service": "emr-ap-southeast-2"
    }, {
        "service_name": "AWS CodeDeploy (Ireland)",
        "summary": "[RESOLVED] Increased Deployment Latencies",
        "date": "1534782477",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 9:28 AM PDT</span>&nbsp;We are investigating increased deployment latencies in the EU-WEST-1 Region.</div><div><span class=\"yellowfg\"> 9:59 AM PDT</span>&nbsp;Between 7:27 AM and 9:56 AM PDT we experienced increased deployment latencies in the EU-WEST-1 Region. The issue has been resolved and the service is operating normally.</div>",
        "service": "codedeploy-eu-west-1"
    }, {
        "service_name": "AWS Single Sign-On (N. Virginia)",
        "summary": "[RESOLVED] Increased Error Rates and Latencies",
        "date": "1534799678",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 2:15 PM PDT</span>&nbsp;We can confirm increased error rates and latencies for the SSO service in the US-EAST-1 Region and continue to work towards resolution.</div><div><span class=\"yellowfg\"> 2:39 PM PDT</span>&nbsp;Between 10:30 AM and 2:18 PM PDT we experienced increased error rates and latencies for the SSO service in the US-EAST-1 Region. The issue has been resolved and the service is operating normally.</div>",
        "service": "sso-us-east-1"
    }, {
        "service_name": "Amazon Connect (N. Virginia)",
        "summary": "[RESOLVED] Call quality degradation",
        "date": "1534866429",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 8:47 AM PDT</span>&nbsp;We are investigating degraded call quality in the US-EAST-1 Region.</div><div><span class=\"yellowfg\"> 9:21 AM PDT</span>&nbsp;Between 7:10 AM and 8:55 AM PDT, we experienced degraded call quality in the US-EAST-1 Region. Agents and end-customers may have experienced increased call latency or static on calls during this time. The issue has been resolved and the service is operating normally. </div>",
        "service": "connect-us-east-1"
    }, {
        "service_name": "Amazon Cognito (Oregon)",
        "summary": "[RESOLVED] Increased API Error Rates",
        "date": "1535399349",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\">12:49 PM PDT</span>&nbsp;We are investigating increased error rates for API calls for Cognito User Pools in the US-WEST-2 Region.</div><div><span class=\"yellowfg\"> 1:16 PM PDT</span>&nbsp;We can confirm increased error rates for API calls for Cognito User Pools in the US-WEST-2 Region and continue to work towards resolution.</div><div><span class=\"yellowfg\"> 1:34 PM PDT</span>&nbsp;Between 11:33 AM and 1:25 PM PDT we experienced increased error rates for API calls for Cognito User Pools in the US-WEST-2 Region. The issue has been resolved and the service is operating normally.</div>",
        "service": "cognito-us-west-2"
    }, {
        "service_name": "Amazon Simple Queue Service (N. Virginia)",
        "summary": "[RESOLVED] Elevated error rates for SQS",
        "date": "1536163992",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 9:13 AM PDT</span>&nbsp;We are currently investigating elevated error rates for SQS in the US-EAST-1 Region.</div><div><span class=\"yellowfg\"> 9:30 AM PDT</span>&nbsp;Between 7:38 AM and 9:18 AM PDT, we experienced elevated API error rates and connection failures in the US-EAST-1 Region. The issue has been resolved and the service is operating normally. </div>",
        "service": "sqs-us-east-1"
    }, {
        "service_name": "Amazon WorkMail (N. Virginia)",
        "summary": "[RESOLVED] Degraded WorkMail performance",
        "date": "1536725279",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 9:08 PM PDT</span>&nbsp;We are investigating degraded WorkMail service performance in the US-EAST-1 Region, impacting IMAP client usability and synchronization of messages.\r\nThere is no impact to Outlook, EWS client applications or mobile clients.</div><div><span class=\"yellowfg\"> 9:40 PM PDT</span>&nbsp;We have identified the cause of degraded WorkMail service performance in the US-EAST-1 Region, impacting IMAP client usability and synchronization of messages and continue working towards resolution. There is no impact to Outlook, EWS client applications or mobile clients.</div><div><span class=\"yellowfg\"> 9:59 PM PDT</span>&nbsp;Between 7:10 PM and 9:46 PM PDT we experienced degraded WorkMail service performance in the US-EAST-1 Region, impacting IMAP client usability and synchronization of messages. The issue has been resolved and the service is operating normally.</div>",
        "service": "workmail-us-east-1"
    }, {
        "service_name": "Amazon Elastic Compute Cloud (Ireland)",
        "summary": "[RESOLVED] Network Connectivity",
        "date": "1537949151",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 1:06 AM PDT</span>&nbsp;We are investigating increased error rates for new launches in the EU-WEST-1 Region.\r\n\r\n</div><div><span class=\"yellowfg\"> 1:37 AM PDT</span>&nbsp;We can confirm increased API error rates and connectivity issues for some instances in a single Availability Zone in the EU-WEST-1 Region.</div><div><span class=\"yellowfg\"> 2:14 AM PDT</span>&nbsp;We continue to investigate connectivity issues from some instances to some AWS services in the EU-WEST-1 Region. We have identified the root cause and are taking steps to resolve the issue.</div><div><span class=\"yellowfg\"> 3:03 AM PDT</span>&nbsp;We have resolved the connectivity issues from EC2 instances to the affected AWS services in the EU-WEST-1 Region. We continue to see elevated error rates for the RunInstances EC2 API, which we are working to resolve. Internet connectivity and connectivity between EC2 instances remain unaffected.</div><div><span class=\"yellowfg\"> 3:28 AM PDT</span>&nbsp;Starting at 12:15 AM PDT we experienced increased API error rates for the EC2 API, and connectivity issues between EC2 instances and AWS services in the EU-WEST-1 Region. At 2:29 AM PDT, the connectivity issues between EC2 instances and AWS services were resolved. At 2:59 AM PDT, the increased API error rates for the EC2 APIs were fully resolved. Internet connectivity and connectivity between EC2 instances was not affected. The issue has been resolved and the service is operating normally.</div>",
        "service": "ec2-eu-west-1"
    }, {
        "service_name": "AWS CloudHSM (Ireland)",
        "summary": "[RESOLVED] Connectivity issues",
        "date": "1537956232",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 3:11 AM PDT</span>&nbsp;We are continuing to investigate connectivity issues impacting CloudHSM and CloudHSM Classic HSMs in a single Availability Zone in EU-WEST-1 Region.</div><div><span class=\"yellowfg\"> 3:44 AM PDT</span>&nbsp;We can confirm that current generation CloudHSM instances are operating normally. CloudHSM Classic instances in a single Availability Zone in the EU-WEST-1 Region are experiencing network connectivity errors. As we work to recover the remaining CloudHSM Classic instances, we will continue to provide updates via the Personal Health Dashboard.</div>",
        "service": "cloudhsm-eu-west-1"
    }, {
        "service_name": "Amazon Elastic File System (Ireland)",
        "summary": "[RESOLVED] Network Connectivity",
        "date": "1537958697",
        "status": 0,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 4:13 AM PDT</span>&nbsp;Between 12:15 AM and 2:12 AM PDT, we experienced increased error rates for console requests in EU-WEST-1 Region. The issue has been resolved and the service is now operating normally.</div>",
        "service": "elasticfilesystem-eu-west-1"
    }, {
        "service_name": "AWS Direct Connect (Ireland)",
        "summary": "[RESOLVED] Network Connectivity",
        "date": "1537960452",
        "status": 0,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 4:19 AM PDT</span>&nbsp;Between 12:15 AM and 2:29 AM PDT, we experienced increased packet loss, impacting AWS Direct Connect connectivity for some customers in the EU-WEST-1 Region. The issue has been resolved and the service is now operating normally.</div>",
        "service": "directconnect-eu-west-1"
    }, {
        "service_name": "Amazon Redshift (N. Virginia)",
        "summary": "[RESOLVED] Increased API Error Rates",
        "date": "1538097782",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 6:23 PM PDT</span>&nbsp;Between 5:45 PM and 6:10 PM PDT we experienced increased API error rates in the US-EAST-1 Region. The issue has been resolved and the service is operating normally.</div>",
        "service": "redshift-us-east-1"
    }, {
        "service_name": "AWS Internet Connectivity (Frankfurt)",
        "summary": "[RESOLVED] Network connectivity",
        "date": "1538413958",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\">10:12 AM PDT</span>&nbsp;We are investigating intermittent connectivity issues between the EU-CENTRAL-1 Region and other AWS Regions.</div><div><span class=\"yellowfg\">10:24 AM PDT</span>&nbsp;We can confirm intermittent issues for Internet and Inter-region network connectivity within the EU-CENTRAL-1 Region. We have mitigated the impact but continue to work towards full resolution.</div><div><span class=\"yellowfg\">10:59 AM PDT</span>&nbsp;Between 9:21 AM and 9:31 AM PDT and between 9:41 AM and 9:51 AM PDT we experienced Internet connectivity issues for the EU-CENTRAL-1 Region and Inter-region connectivity issues between the EU-CENTRAL-1 Region and other AWS regions. The issue has been resolved and the service is operating normally.</div>",
        "service": "internetconnectivity-eu-central-1"
    }, {
        "service_name": "Amazon Elastic Compute Cloud (Oregon)",
        "summary": "[RESOLVED] Increased API Errors ",
        "date": "1538424731",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 1:12 PM PDT</span>&nbsp;We are investigating increased error rates and latencies for the EC2 APIs in the US-WEST-2 Region.</div><div><span class=\"yellowfg\"> 2:06 PM PDT</span>&nbsp;We continue to investigate increased error rates and latencies for the EC2 APIs and EC2 Management Console in the US-WEST-2 Region. Existing EC2 instances are not affected.</div><div><span class=\"yellowfg\"> 3:14 PM PDT</span>&nbsp;We are seeing recovery for the increased error rates and latencies affecting the EC2 APIs in the US-WEST-2 Region. Some requests may return a \"request limit exceeded\" error as we work toward full recovery. We recommend retrying failed requests.</div><div><span class=\"yellowfg\"> 4:41 PM PDT</span>&nbsp;Error rates and latencies for the EC2 APIs in the US-WEST-2 Region remain at normal levels. A small percentage of requests are still returning a \"request limit exceeded\" error as we work toward full recovery. We recommend retrying failed requests.</div><div><span class=\"yellowfg\"> 5:33 PM PDT</span>&nbsp;Starting at 11:20 AM PDT, we experienced periods of increased error rates and latencies for the EC2 APIs in the US-WEST-2 Region. At 2:02 PM PDT, error rates and latencies recovered for the majority of the affected APIs. At 2:55 PM PDT error rates and latencies returned to normal levels but some customers continued to experience \"request limit exceeded\" errors. At 5:10 PM PDT, all error rates, including \"request limit exceeded\" errors, returned to normal levels. The issue has been resolved and the service is operating normally.</div>",
        "service": "ec2-us-west-2"
    }, {
        "service_name": "Auto Scaling (Oregon)",
        "summary": "[RESOLVED] Increased Launch Latencies ",
        "date": "1538428181",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 2:09 PM PDT</span>&nbsp;We are investigating increased launch times for EC2 instances managed by Auto Scaling in the US-WEST-2 Region.</div><div><span class=\"yellowfg\"> 3:29 PM PDT</span>&nbsp;Between 12:32 PM PDT and 2:40 PM PDT, we experienced elevated launch times for EC2 instance managed by Auto Scaling in the US-WEST-2 Region. The issue has been resolved and the service is operating normally. </div>",
        "service": "autoscaling-us-west-2"
    }, {
        "service_name": "AWS Lambda (Oregon)",
        "summary": "[RESOLVED] Increased API Error Rates",
        "date": "1538428351",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 2:12 PM PDT</span>&nbsp;We are investigating increased error rates for newly created functions in the US-WEST-2 Region. This includes functions created via the console as well as those created via the API or CLI.</div><div><span class=\"yellowfg\"> 3:51 PM PDT</span>&nbsp;We continue to investigate increased error rates for newly created VPC functions in the US-WEST-2 Region. This includes VPC functions created via the console as well as those created via the API or CLI. The issue has been resolved for non-VPC functions. </div><div><span class=\"yellowfg\"> 5:14 PM PDT</span>&nbsp;Between 12:47 PM PDT and 4:55 PM PDT, we experienced increased error rates for newly created functions in US-WEST-2 Region. The issue has been resolved and the service is operating normally.</div>",
        "service": "lambda-us-west-2"
    }, {
        "service_name": "Amazon Elastic Load Balancing (Oregon)",
        "summary": "[RESOLVED] Increased Provisioning Latencies ",
        "date": "1538428470",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 2:14 PM PDT</span>&nbsp;We are investigating increased provisioning times for load balancers in the US-WEST-2 Region. Connectivity to existing load balancers is not affected.</div><div><span class=\"yellowfg\"> 3:49 PM PDT</span>&nbsp;We are seeing an improvement in the increased provisioning times affecting load balancers in the US-WEST-2 Region. We continue to work towards full recovery.</div><div><span class=\"yellowfg\"> 5:25 PM PDT</span>&nbsp;Between 1:00 PM and 4:48 PM PDT, we experienced increased provisioning times for load balancers in the US-WEST-2 Region. Connectivity to load balancers was not affected. The issue has been resolved and the service is operating normally.</div>",
        "service": "elb-us-west-2"
    }, {
        "service_name": "Amazon Elastic MapReduce (Oregon)",
        "summary": "[RESOLVED] Delays in starting clusters",
        "date": "1538429178",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 2:26 PM PDT</span>&nbsp;We are investigating delays in starting clusters in the US-WEST-2 Region. Existing clusters are not affected.</div><div><span class=\"yellowfg\"> 3:53 PM PDT</span>&nbsp;We continue to investigate delays in starting clusters in the US-WEST-2 Region. Existing clusters are not affected. </div><div><span class=\"yellowfg\"> 5:11 PM PDT</span>&nbsp;Between 1:10 PM and 4:20 PM PDT we experienced delays in starting clusters in US-West-2 Region. Existing clusters were not affected. The issue has been resolved and the service is operating normally.</div><div><span class=\"yellowfg\"> 5:17 PM PDT</span>&nbsp;Between 1:10 PM and 4:20 PM PDT we experienced delays in starting clusters in US-WEST-2 Region. Existing clusters were not affected. The issue has been resolved and the service is operating normally.</div>",
        "service": "emr-us-west-2"
    }, {
        "service_name": "Amazon WorkSpaces (Oregon)",
        "summary": "[RESOLVED] Increased Provisioning Error Rates",
        "date": "1538430961",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 2:56 PM PDT</span>&nbsp;We are investigating increased error rates and latencies for provisioning new WorkSpaces in the US-WEST-2 Region</div><div><span class=\"yellowfg\"> 3:21 PM PDT</span>&nbsp;Between 1:00 PM and 3:00 PM PDT, we experienced increased error rates for new WorkSpaces provisioning in the US-WEST-2 Region. Existing WorkSpaces were unaffected. The issue has been resolved and the service is operating normally. </div>",
        "service": "workspaces-us-west-2"
    }, {
        "service_name": "Amazon Elastic Compute Cloud (Oregon)",
        "summary": "[RESOLVED] Increased API Errors",
        "date": "1538626579",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 9:16 PM PDT</span>&nbsp;We're investigating increased error rates and latencies for the EC2 APIs in the US-WEST-2 Region.</div><div><span class=\"yellowfg\"> 9:45 PM PDT</span>&nbsp;Between 8:48 PM and 9:25 PM PDT we experienced increased error rates and latencies in the US-WEST-2 Region. The issue has been resolved and the service is operating normally.</div>",
        "service": "ec2-us-west-2"
    }, {
        "service_name": "AWS Secrets Manager (Oregon)",
        "summary": "[RESOLVED] Elevated latencies and API Error Rates",
        "date": "1538645129",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 2:25 AM PDT</span>&nbsp;We are investigating elevated latencies and API error rates in the US-WEST-2 Region.</div><div><span class=\"yellowfg\"> 3:09 AM PDT</span>&nbsp;We continue to investigate elevated latencies and API error rates in the US-WEST-2 Region.</div><div><span class=\"yellowfg\"> 8:04 AM PDT</span>&nbsp;Between 2:04 AM and 7:50 AM PDT we experienced increased API error rates and latencies in the US-WEST-2 Region. The issue has been resolved and the service is operating normally.</div>",
        "service": "secretsmanager-us-west-2"
    }, {
        "service_name": "Amazon Simple Storage Service (Ohio)",
        "summary": "[RESOLVED] Increased Error Rates",
        "date": "1538766090",
        "status": 2,
        "details": "",
        "description": "<div><span class=\"yellowfg\">12:01 PM PDT</span>&nbsp;We are investigating increased error rates for Amazon S3 requests in the US-EAST-2 Region.</div><div><span class=\"yellowfg\">12:16 PM PDT</span>&nbsp;We have identified the root cause of the increased error rates in the US-EAST-2 Region and are working towards resolution.</div><div><span class=\"yellowfg\">12:42 PM PDT</span>&nbsp;We have identified the root cause and are seeing some recovery. We are continuing to monitor and work towards full resolution.</div><div><span class=\"yellowfg\">12:51 PM PDT</span>&nbsp;Between 11:47 AM and 12:33 PM PDT we experienced increased error rates for Amazon S3 requests in the US-EAST-2 Region. The issue has been resolved and the service is operating normally.</div>",
        "service": "s3-us-east-2"
    }, {
        "service_name": "Amazon Glacier (Ohio)",
        "summary": "[RESOLVED] Increased Error Rates",
        "date": "1538768132",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\">12:35 PM PDT</span>&nbsp;We are investigating increased error rates and latency in the US-EAST-2 Region. </div><div><span class=\"yellowfg\">12:48 PM PDT</span>&nbsp;Between 11:47 AM PDT and 12:33 PM PDT we experienced increased API error rates and latencies in the US-EAST-2 Region. The issue has been resolved and the service is operating normally. </div>",
        "service": "glacier-us-east-2"
    }, {
        "service_name": "Amazon Kinesis Firehose (Ohio)",
        "summary": "[RESOLVED] Delayed Data Delivery",
        "date": "1538768432",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\">12:40 PM PDT</span>&nbsp;We are investigating delays in S3 delivery for Kinesis Firehose in the US-EAST-2 Region.</div><div><span class=\"yellowfg\"> 1:01 PM PDT</span>&nbsp;Between 11:47 AM and 12:38 PM PDT we experienced increased Firehose to S3 delivery delays in the US-EAST-2 Region. The issue has been resolved and the service is operating normally. </div>",
        "service": "firehose-us-east-2"
    }, {
        "service_name": "Amazon Elastic Compute Cloud (Ohio)",
        "summary": "[RESOLVED] Degraded Volume Performance for EBS Volumes / Insufficient-Data for EC2 Instance Status Checks",
        "date": "1538769418",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\">12:57 PM PDT</span>&nbsp;Between 11:47 AM and 12:33 PM PDT we experienced degraded performance for some EBS volumes in the US-EAST-2 Region. During this time, some customers also experienced insufficient-data in the results from EC2 instance status checks. CloudWatch alarms may have transitioned into \"INSUFFICIENT_DATA\" state if set on the delayed metrics. EC2 instances operated normally during this time; only EC2 CloudWatch metrics were affected. The issue has been resolved and the service is operating normally.</div>",
        "service": "ec2-us-east-2"
    }, {
        "service_name": "AWS CodeCommit (Ohio)",
        "summary": "[RESOLVED] Increased Error Rates",
        "date": "1538769625",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 1:00 PM PDT</span>&nbsp;Between 11:47 AM PDT and 12:33 PM PDT we experienced an increased error rate for APIs and Git Push/Pull in the US-EAST-2 Region. The issue has been resolved and the service is operating normally. </div>",
        "service": "codecommit-us-east-2"
    }, {
        "service_name": "Amazon Elastic Container Service (Ohio)",
        "summary": "[RESOLVED] Increased Error Rates",
        "date": "1538770316",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 1:12 PM PDT</span>&nbsp;Between 11:47 AM and 12:33 PM PDT we experienced increased error rates when launching Fargate tasks in the US-EAST-2 Region. Running tasks were not impacted. The issue has been resolved and the service is operating normally.</div>",
        "service": "ecs-us-east-2"
    }, {
        "service_name": "Amazon Connect (N. Virginia)",
        "summary": "[RESOLVED] Increased Errors",
        "date": "1538776626",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 2:57 PM PDT</span>&nbsp;We are currently investigating increased latencies and errors for the Agent Call Control Panel in the US-EAST-1 Region.</div><div><span class=\"yellowfg\"> 3:08 PM PDT</span>&nbsp;Between 11:27 AM and 2:52 PM PDT, we experienced increased latencies and errors for the Agent Call Control Panel in the US-EAST-1 Region. The issue has been resolved and the service is operating normally. </div>",
        "service": "connect-us-east-1"
    }, {
        "service_name": "Amazon Elastic Compute Cloud (N. Virginia)",
        "summary": "[RESOLVED] Title: Increased Launch Errors ",
        "date": "1539093649",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 7:01 AM PDT</span>&nbsp;Between 5:31 AM and 6:42 AM PDT we experienced increased error rates for instance launches in a single availability zone in the US-EAST-1 Region. Existing instances were unaffected. The issue has been resolved and the service is operating normally.</div>",
        "service": "ec2-us-east-1"
    }, {
        "service_name": "Amazon Elasticsearch Service (N. California)",
        "summary": "[RESOLVED] Domain Connectivity",
        "date": "1539650824",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 5:50 PM PDT</span>&nbsp;We are investigating connectivity issues for some domains in the US-WEST-1 Region.</div><div><span class=\"yellowfg\"> 6:35 PM PDT</span>&nbsp;Between 4:50 PM and 6:20 PM PDT we experienced domain connectivity issues in the US-WEST-1 Region. The issue has been resolved and the service is operating normally.</div>",
        "service": "elasticsearch-us-west-1"
    }, {
        "service_name": "Amazon Elastic Compute Cloud (N. Virginia)",
        "summary": "[RESOLVED] Network Connectivity",
        "date": "1539804061",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\">12:22 PM PDT</span>&nbsp;We are investigating network connectivity issues for some instances within the US-EAST-1 Region.</div><div><span class=\"yellowfg\">12:30 PM PDT</span>&nbsp;Between 11:27 AM and 11:28 AM PDT some instances experienced connectivity issues for network traffic between Availability Zones within the US-EAST-1 Region. The issue was automatically mitigated and we continue to monitor all affected instances. </div><div><span class=\"yellowfg\"> 1:06 PM PDT</span>&nbsp;Between 11:27 AM and 11:28 AM PDT some instances experienced connectivity issues for network traffic between Availability Zones within the US-EAST-1 Region. The issue has been resolved and the service is operating normally. </div>",
        "service": "ec2-us-east-1"
    }, {
        "service_name": "Amazon Elastic Load Balancing (N. Virginia)",
        "summary": "[RESOLVED] Increased provisioning and registration times ",
        "date": "1539806007",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\">12:53 PM PDT</span>&nbsp;We are investigating increased provisioning and back-end target registration times for load balancers within the US-EAST-1 Region. Connectivity to existing load balancers is not affected.</div><div><span class=\"yellowfg\"> 2:18 PM PDT</span>&nbsp;We continue to work on resolving the increased provisioning and back-end target registration times for Classic and Application Load Balancers within the US-EAST-1 Region. Provisioning and back-end target registration times are not affected for Network Load Balancers. Connectivity to all load balancers is not affected.</div><div><span class=\"yellowfg\"> 2:59 PM PDT</span>&nbsp;Beginning at 11:50 AM PDT we experienced increased provisioning times for Classic and Application Load Balancers within the US-EAST-1 Region. At 12:40 PM PDT, registration times for new back-end targets began to increase. At 2:05 PM PDT, both load balancer provisioning and back-end target registration latencies began to recover. By 2:25 PM PDT, back-end target registration times had returned to normal levels and by 2:44 PM PDT load balancer provisioning had fully recovered. Connectivity to load balancers was not affected. The issue has been resolved and the service is operating normally.</div>",
        "service": "elb-us-east-1"
    }, {
        "service_name": "Amazon Relational Database Service (N. Virginia)",
        "summary": "[RESOLVED] Network Connectivity",
        "date": "1539806429",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 1:02 PM PDT</span>&nbsp;Between 11:28 AM and 11:31 AM PDT some Multi-AZ and Single-AZ RDS instances experienced network connectivity issues in the US-EAST-1 Region. All affected Multi-AZ RDS instances failed over to a second Availability Zone, which restored connectivity. The majority of the Single-AZ RDS instances have recovered and we continue to work on restoring connectivity to a small number of remaining Single-AZ RDS instances.\r\n</div><div><span class=\"yellowfg\"> 1:28 PM PDT</span>&nbsp;Between 11:28 AM and 11:31 AM PDT some Multi-AZ and Single-AZ RDS instances experienced network connectivity issues in the US-EAST-1 Region. All affected Multi-AZ RDS instances failed over to a second Availability Zone, which restored connectivity. The remaining Single-AZ RDS instances have now restored connectivity. The issue has been resolved and the service is operating normally.</div>",
        "service": "rds-us-east-1"
    }, {
        "service_name": "Auto Scaling (N. Virginia)",
        "summary": "[RESOLVED] Increased Error Rates ",
        "date": "1539810083",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 2:02 PM PDT</span>&nbsp;We are experiencing increased API error rates and delayed group scaling in the US-EAST-1 Region. Connectivity to existing EC2 Instances is not affected.</div><div><span class=\"yellowfg\"> 3:45 PM PDT</span>&nbsp;We have identified the root cause of the increased API error rates and delayed group scaling in the US-EAST-1 Region. We are beginning to see recovery and continue to work toward full resolution. </div><div><span class=\"yellowfg\"> 4:07 PM PDT</span>&nbsp;Between 11:28 AM and 4:05 PM PDT we experienced increased API error rates and delayed group scaling in the US-EAST-1 Region. Connectivity to existing EC2 Instances was not affected. The issue has been resolved and the service is operating normally. </div>",
        "service": "autoscaling-us-east-1"
    }, {
        "service_name": "Amazon Elastic Compute Cloud (N. California)",
        "summary": "[RESOLVED] Increased API Error Rates and Latencies",
        "date": "1539971754",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\">10:56 AM PDT</span>&nbsp;We are investigating increased API error rates and latencies in the US-WEST-1 Region. </div><div><span class=\"yellowfg\">11:27 AM PDT</span>&nbsp;Between 10:22 AM and 10:33 AM PDT, and between 10:47 AM and 11:06 AM PDT, we experienced increased API error rates and latencies in the US-WEST-1 Region. APIs also returned insufficient-data in the results from EC2 instance status checks and CloudWatch alarms transitioned into \"INSUFFICIENT_DATA\" state if set on the delayed metrics. EC2 instances operated normally during this time. The issue has been resolved and the service is operating normally. </div>",
        "service": "ec2-us-west-1"
    }, {
        "service_name": "Amazon Simple Storage Service (N. California)",
        "summary": "[RESOLVED] Increased Error Rates",
        "date": "1539972265",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\">11:04 AM PDT</span>&nbsp;We are investigating increased error rates for Amazon S3 requests in the US-WEST-1 Region.</div><div><span class=\"yellowfg\">11:19 AM PDT</span>&nbsp;Between 10:22 AM and 10:33 AM PDT, and between 10:47 AM and 11:06 AM PDT, we experienced elevated failure rates for some Amazon S3 requests in the US-WEST-1 Region. The issue has been resolved and the service is operating normally.</div>",
        "service": "s3-us-west-1"
    }, {
        "service_name": "Amazon DynamoDB (N. California)",
        "summary": "[RESOLVED] Elevated Failure Rates",
        "date": "1539973333",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\">11:22 AM PDT</span>&nbsp;Between 10:22 AM and 10:33 AM PDT, and between 10:47 AM and 11:06 AM PDT, we experienced elevated failure rates for some Amazon DynamoDB requests in the US-WEST-1 Region. The issue has been resolved and the service is operating normally.</div>",
        "service": "dynamodb-us-west-1"
    }, {
        "service_name": "Amazon Connect (N. Virginia)",
        "summary": "[RESOLVED] Degraded Metrics Performance",
        "date": "1540316843",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\">10:47 AM PDT</span>&nbsp;We are investigating delays in forming contact trace records, and degraded service for the metrics and call recording UI in the US-EAST-1 Region. Call handling is not affected.</div><div><span class=\"yellowfg\">11:16 AM PDT</span>&nbsp;We continue to investigate delays in forming contact trace records, and degraded performance of the metrics and call recording search experience in the US-EAST-1 region. Call handling is not affected.</div><div><span class=\"yellowfg\">12:11 PM PDT</span>&nbsp;Between 9:50 AM and 11:40 AM PDT, we experienced delays in forming contact trace records, and degraded performance of the metrics and call recording search experience in the US-EAST-1 Region. No metrics or call recordings were lost, and call handling was not affected. The issue has been resolved and the service is operating normally. </div>",
        "service": "connect-us-east-1"
    }, {
        "service_name": "Amazon WorkSpaces (Ireland)",
        "summary": "[RESOLVED] Connection errors",
        "date": "1540431788",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 6:43 PM PDT</span>&nbsp;We are investigating increased error rates when connecting to WorkSpaces in the EU-WEST-1 Region.</div><div><span class=\"yellowfg\"> 7:18 PM PDT</span>&nbsp;We can confirm increased error rates when connecting to WorkSpaces in the EU-WEST-1 Region. Connections using WorkSpaces Web Access are not affected by this issue.</div><div><span class=\"yellowfg\"> 7:57 PM PDT</span>&nbsp;We have identified the cause of increased error rates when connecting to some WorkSpaces in the EU-WEST-1 Region and continue working towards resolution. Connections using WorkSpaces Web Access are not affected by this issue.</div><div><span class=\"yellowfg\">10:05 PM PDT</span>&nbsp;We have identified the cause of increased error rates when connecting to some WorkSpaces in the EU-WEST-1 Region and are in process of resolving. Connections using WorkSpaces Web Access are not affected by this issue.</div><div><span class=\"yellowfg\">10:29 PM PDT</span>&nbsp;We experienced an issue causing increased error rates when connecting to WorkSpaces from native clients in the EU-WEST-1 Region. The issue has been resolved and the service is operating normally.</div>",
        "service": "workspaces-eu-west-1"
    }, {
        "service_name": "AWS Identity and Access Management",
        "summary": "[RESOLVED] Increased API Latencies",
        "date": "1540486732",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 9:59 AM PDT</span>&nbsp;We are investigating an increased latency on administrative APIs. Create, Delete, List, Get, and Update API actions may be impacted in multiple regions. Other AWS services whose features require IAM roles will also be impacted. User authentications and authorizations are not impacted.</div><div><span class=\"yellowfg\">10:40 AM PDT</span>&nbsp;We continue to investigate increased latency on administrative APIs. Create, Delete, List, Get, and Update API actions may be impacted in multiple regions. Other AWS services like AWS CloudFormation and AWS Lambda that use IAM roles may also be impacted. User authentications and authorizations are not impacted. </div><div><span class=\"yellowfg\">11:31 AM PDT</span>&nbsp;We have identified the root cause and are working towards a resolution for increased latency on administrative APIs. Create, Delete, List, Get, and Update API actions may be impacted in multiple regions. Other AWS services like AWS CloudFormation and AWS Lambda that use IAM roles may also be impacted. User authentications and authorizations are not impacted.</div><div><span class=\"yellowfg\">12:40 PM PDT</span>&nbsp;We are seeing improvement in the latency for administrative APIs (Create, Delete, List, Get, and Update). We are continuing to work towards a full resolution. User authentications and authorizations are not impacted. </div><div><span class=\"yellowfg\">12:57 PM PDT</span>&nbsp;Between 8:28 AM and 12:31 PM PDT, we experienced increased latency on administrative APIs. Create, Delete, List, Get, and Update API actions were impacted in multiple regions. User authentications and authorizations were not impacted. The issue has been resolved, and the service is operating normally.</div>",
        "service": "iam"
    }, {
        "service_name": "AWS Identity and Access Management",
        "summary": "[RESOLVED]  Increased Console Error Rates",
        "date": "1542102750",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 1:52 AM PST</span>&nbsp;We are investigating increased error rates in the IAM console impacting policy operations for all IAM entities.</div><div><span class=\"yellowfg\"> 2:27 AM PST</span>&nbsp;Between 12:33 AM and 1:33 AM PST we experienced increased error rates in the IAM console impacting policy operations for all IAM entities. The issue has been resolved and the service is operating normally.</div>",
        "service": "iam"
    }, {
        "service_name": "AWS Certificate Manager (Ireland)",
        "summary": "[RESOLVED] Validation and Issuance Delays for New Certificates",
        "date": "1542220203",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\">10:31 AM PST</span>&nbsp;We are investigating delays in validating domains for public certificates and delays issuing private certificates requested through ACM in the EU-WEST-1 Region.</div><div><span class=\"yellowfg\">11:23 AM PST</span>&nbsp;We can confirm delays in validating domains for public certificates and delays issuing private certificates requested through ACM in the EU-WEST-1 Region. Existing certificates and previously deployed certificates are unaffected.</div><div><span class=\"yellowfg\">12:22 PM PST</span>&nbsp;We have identified the root cause of delays in validating domains for public certificates and delays issuing private certificates requested through ACM in the EU-WEST-1 Region. We are beginning to see recovery and continue to work toward full resolution. Existing certificates and previously deployed certificates are unaffected.</div><div><span class=\"yellowfg\"> 2:40 PM PST</span>&nbsp;Between 5:45 AM and 1:20 PM PST we experienced delays in validating domains for public certificates and delays issuing private certificates requested through ACM in the EU-WEST-1 Region. Existing certificates and previously deployed certificates were unaffected. The issue has been resolved and the service is operating normally.</div>",
        "service": "certificatemanager-eu-west-1"
    }, {
        "service_name": "Amazon Transcribe (Oregon)",
        "summary": "[RESOLVED] Increased API Error Rates",
        "date": "1542530957",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\">12:49 AM PST</span>&nbsp;We are investigating increased API error rates in the US-WEST-2 Region.</div><div><span class=\"yellowfg\"> 1:23 AM PST</span>&nbsp;Between 9:51 PM on November 17th, and 1:02 AM PST on November 18th, we experienced increased API error rates in the US-WEST-2 Region. The issue has been resolved and the service is operating normally. </div>",
        "service": "transcribe-us-west-2"
    }, {
        "service_name": "Amazon Elastic Container Registry (Oregon)",
        "summary": "[RESOLVED] Elevated API Error Rates",
        "date": "1542674869",
        "status": 2,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 4:48 PM PST</span>&nbsp;We are experiencing elevated error rates for all APIs in the US-WEST-2 Region. </div><div><span class=\"yellowfg\"> 5:14 PM PST</span>&nbsp;We have identified the root cause of the increased API error rates. We are beginning to see recovery, and continue to work towards full resolution.</div><div><span class=\"yellowfg\"> 5:27 PM PST</span>&nbsp;Between 4:02 PM and 5:04 PM PST we experienced increased API error rates for the ECR APIs in the US-WEST-2 Region. The issue has been resolved and the service is operating normally.</div>",
        "service": "ecr-us-west-2"
    }, {
        "service_name": "Amazon Elastic Compute Cloud (N. Virginia)",
        "summary": "[RESOLVED] Increased API and Launch Error Rates",
        "date": "1542721813",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 5:50 AM PST</span>&nbsp;We are investigating increased API and launch error rates in a single Availability Zone in the US-EAST-1 Region.</div><div><span class=\"yellowfg\"> 6:20 AM PST</span>&nbsp;Between 5:06 AM and 5:50 AM PST we experienced elevated error rates for instance related APIs and new instance launches in a single Availability Zone in the US-EAST-1 Region. Existing instances were not affected. The issue has been resolved and the service is operating normally.</div>",
        "service": "ec2-us-east-1"
    }, {
        "service_name": "Amazon Simple Storage Service (Ohio)",
        "summary": "[RESOLVED] Increased Error Rates",
        "date": "1542766836",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 6:20 PM PST</span>&nbsp;Between 5:15 PM and 5:55 PM PST, we experienced intermittent increased error rates for a subset of requests made to the Amazon S3 APIs in the US-EAST-2 Region. The issue has been resolved and the service is operating normally.</div>",
        "service": "s3-us-east-2"
    }, {
        "service_name": "Amazon Elastic Compute Cloud (Seoul)",
        "summary": "[RESOLVED] DNS Resolution Issues",
        "date": "1542844952",
        "status": "2",
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 4:02 PM PST</span>&nbsp;We are investigating intermittent DNS resolution issues for some instances in the AP-NORTHEAST-2 Region. </div><div><span class=\"yellowfg\"> 4:36 PM PST</span>&nbsp;We have identified the cause of the DNS resolution issues for some instances in the AP-NORTHEAST-2 Region and continue working towards resolution.\r\n</div><div><span class=\"yellowfg\"> 5:01 PM PST</span>&nbsp;Between 3:19 PM and 4:43 PM PST we experienced DNS resolution issues for some instances in the AP-NORTHEAST-2 Region. Some AWS services experienced elevated error rates as a result of this issue. The issue has been resolved and the service is operating normally. <br> <br>Additional details have been provided <a href=\"https://aws.amazon.com/message/74876/\">here</a>. Customers who have questions about this event can contact the AWS Support team by <a href=\"https://aws.amazon.com/support\">opening a case in the AWS Support Center</a>. </div>",
        "service": "ec2-ap-northeast-2"
    }, {
        "service_name": "AWS Lambda (Seoul)",
        "summary": "[RESOLVED] Increased Error Rates",
        "date": "1542846560",
        "status": 2,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 4:29 PM PST</span>&nbsp;We are investigating increased API error rates in the AP-NORTHEAST-2 Region.</div><div><span class=\"yellowfg\"> 5:18 PM PST</span>&nbsp;We have identified the root cause and are seeing recovery. We continue to work toward full resolution. </div><div><span class=\"yellowfg\"> 6:19 PM PST</span>&nbsp;Between 3:19 PM and 5:58 PM PST we experienced increased API error rates in the AP-NORTHEAST-2 Region. The issue has been resolved and the service is operating normally.</div>",
        "service": "lambda-ap-northeast-2"
    }, {
        "service_name": "AWS Elastic Beanstalk (Seoul)",
        "summary": "[RESOLVED] Increased Error Rates",
        "date": "1542847301",
        "status": 2,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 4:41 PM PST</span>&nbsp;We are currently investigating increased error rates to Elastic Beanstalk APIs in the AP-NORTHEAST-2 Region.</div><div><span class=\"yellowfg\"> 5:09 PM PST</span>&nbsp;Between 3:19 PM and 4:43 PM PST we experienced increased error rates in the AP-NORTHEAST-2 Region. The issue has been resolved and the service is operating normally.</div>",
        "service": "elasticbeanstalk-ap-northeast-2"
    }, {
        "service_name": "Amazon API Gateway (Seoul)",
        "summary": "[RESOLVED] Increased Error Rates",
        "date": "1542847420",
        "status": 2,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 4:43 PM PST</span>&nbsp;We are investigating increased error rates for invokes in the AP-NORTHEAST-2 Region.</div><div><span class=\"yellowfg\"> 5:00 PM PST</span>&nbsp;Between 3:19 PM and 4:43 PM PST we experienced increased error rates in the AP-NORTHEAST-2 Region. The issue has been resolved and the service is operating normally. </div>",
        "service": "apigateway-ap-northeast-2"
    }, {
        "service_name": "Amazon MQ (Seoul)",
        "summary": "[RESOLVED] Increased Error Rates",
        "date": "1542847452",
        "status": 2,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 4:44 PM PST</span>&nbsp;We are investigating increased API error rates in AP-NORTHEAST-2 Region.</div><div><span class=\"yellowfg\"> 5:20 PM PST</span>&nbsp;We have identified the root cause and are seeing recovery. We continue to work toward full resolution. </div><div><span class=\"yellowfg\"> 5:40 PM PST</span>&nbsp;Between 3:19 PM and 5:28 PM PST we experienced increased API error rates in AP-NORTHEAST-2 Region. The issue has been resolved and the service is operating normally. </div>",
        "service": "mq-ap-northeast-2"
    }, {
        "service_name": "Amazon Kinesis Firehose (Seoul)",
        "summary": "[RESOLVED] Increased Error Rates",
        "date": "1542847565",
        "status": 2,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 4:46 PM PST</span>&nbsp;We are investigating increased API fault rates in the AP-NORTHEAST-2 Region.</div><div><span class=\"yellowfg\"> 5:05 PM PST</span>&nbsp;Between 3:19 PM and 4:43 PM PST we experienced increased API fault rates and latencies in the AP-NORTHEAST-2 Region. The issue has been resolved and the service is operating normally. </div>",
        "service": "firehose-ap-northeast-2"
    }, {
        "service_name": "AWS IoT Core (Seoul)",
        "summary": "[RESOLVED] Increased Error Rates",
        "date": "1542848046",
        "status": 2,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 4:54 PM PST</span>&nbsp;We are currently investigating increased error rates for AWS IoT Core in the AP-NORTHEAST-2 Region.</div><div><span class=\"yellowfg\"> 5:09 PM PST</span>&nbsp;Between 3:19 PM and 4:51 PM PST we experienced increased error rates in the AP-NORTHEAST-2 Region. The issue has been resolved and the service is operating normally.</div>",
        "service": "awsiot-ap-northeast-2"
    }, {
        "service_name": "Amazon WorkSpaces (Seoul)",
        "summary": "[RESOLVED] Increased Error Rates",
        "date": "1542848776",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 5:06 PM PST</span>&nbsp;Between 3:15 PM and 4:40 PM PST we experienced increased errors for connections to WorkSpaces in the AP-NORTHEAST-2 Region. The issue has been resolved and the service is operating normally. </div>",
        "service": "workspaces-ap-northeast-2"
    }, {
        "service_name": "Amazon Redshift (Seoul)",
        "summary": "[RESOLVED] Increased Error Rates",
        "date": "1542849499",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 5:18 PM PST</span>&nbsp;Between 3:19 PM and 4:56 PM PST we experienced API and S3 connectivity failures in AP-NORTHEAST-2 Region. The issue has been resolved and the service is operating normally.</div>",
        "service": "redshift-ap-northeast-2"
    }, {
        "service_name": "AWS X-Ray (Seoul)",
        "summary": "[RESOLVED] Increased Error Rates",
        "date": "1542849575",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 5:19 PM PST</span>&nbsp;Between 3:19 PM and 4:43 PM PST we experienced increased error rates for API calls in the AP-NORTHEAST-2 Region. The issue has been resolved and the service is operating normally. </div>",
        "service": "xray-ap-northeast-2"
    }, {
        "service_name": "AWS Billing Console",
        "summary": "[RESOLVED] Increased Billing Console Error Rates",
        "date": "1543787631",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 1:54 PM PST</span>&nbsp;We are investigating errors affecting the Billing Console including the Dashboard and the Bills page.</div><div><span class=\"yellowfg\"> 2:22 PM PST</span>&nbsp;Between 12:28 PM and 2:10 PM PST we experienced increased error rates affecting the Billing Console including the Dashboard and the Bills page. The issue has been resolved and the service is operating normally.</div>",
        "service": "billingconsole"
    }, {
        "service_name": "Amazon Elastic File System (N. Virginia)",
        "summary": "[RESOLVED] Increased Error Rates",
        "date": "1543880790",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 3:46 PM PST</span>&nbsp;We are investigating increased error rates for file system creation requests in the US-EAST-1 Region.</div><div><span class=\"yellowfg\"> 4:13 PM PST</span>&nbsp;We are continuing to experience increased error rates for file system creation requests in the US-EAST-1 Region, and are actively working to resolve the issue.</div><div><span class=\"yellowfg\"> 5:02 PM PST</span>&nbsp;Between 2:40 PM and 4:45 PM PST, we experienced increased error rates for file system creation requests in the US-EAST-1 Region. The issue has been resolved and the service is now operating normally.</div>",
        "service": "elasticfilesystem-us-east-1"
    }, {
        "service_name": "AWS Management Console (US-West)",
        "summary": "[RESOLVED] Increased Error Rates",
        "date": "1544570280",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 3:18 PM PST</span>&nbsp;We are investigating increased error rates for the AWS Management Console in the US-GOV-WEST-1 Region.</div><div><span class=\"yellowfg\"> 3:56 PM PST</span>&nbsp;Between 2:11 PM and 3:41 PM PST we experienced increased error rates for the AWS Management Console in the US-GOV-WEST-1 Region. The issue has been resolved and the service is operating normally.</div>",
        "service": "management-console-us-gov-west-1"
    }, {
        "service_name": "AWS Key Management Service (Sao Paulo)",
        "summary": "[RESOLVED] Increased Error Rates",
        "date": "1544584045",
        "status": 2,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 7:07 PM PST</span>&nbsp;We are investigating increased error rates on the KMS CreateKey API in the SA-EAST-1 Region.</div><div><span class=\"yellowfg\"> 7:34 PM PST</span>&nbsp;We have identified the root cause for the increased error rates on the KMS CreateKey API in the SA-EAST-1 Region and continue to work towards resolution.</div><div><span class=\"yellowfg\"> 8:16 PM PST</span>&nbsp;Between 6:23 PM and 8:03 PM PST, we experienced increased error rates on the KMS CreateKey API in the SA-EAST-1 Region. This issue has been resolved and the service is operating normally.</div>",
        "service": "kms-sa-east-1"
    }, {
        "service_name": "Amazon Elastic Container Registry (N. Virginia)",
        "summary": "[RESOLVED] Elevated API Error Rates",
        "date": "1545248645",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\">11:44 AM PST</span>&nbsp;We are investigating increased API error rates for the ECR APIs in the US-EAST-1 Region. </div><div><span class=\"yellowfg\">11:58 AM PST</span>&nbsp;Between 11:14 AM and 11:51 AM PST we experienced increased API error rates for the ECR APIs in the US-EAST-1 Region. The issue has been resolved and the service is operating normally. </div>",
        "service": "ecr-us-east-1"
    }, {
        "service_name": "Amazon WorkSpaces (N. Virginia)",
        "summary": "[RESOLVED] Increased errors terminating WorkSpaces",
        "date": "1546532318",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 8:18 AM PST</span>&nbsp;We are investigating increased errors when terminating WorkSpaces in the US-EAST-1 Region.</div><div><span class=\"yellowfg\"> 9:23 AM PST</span>&nbsp;Between 6:40 AM and 9:14 AM PST Amazon WorkSpaces experienced increased errors when terminating WorkSpaces in the US-EAST-1 Region. The issue causing increased errors has been resolved and the service is operating normally.</div>",
        "service": "workspaces-us-east-1"
    }, {
        "service_name": "Amazon Elastic Compute Cloud (London)",
        "summary": "[RESOLVED] Network Connectivity",
        "date": "1547258341",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 5:59 PM PST</span>&nbsp;We are investigating network connectivity issues for some instances in a single Available Zone in the EU-WEST-2 Region.</div><div><span class=\"yellowfg\"> 6:29 PM PST</span>&nbsp;We can confirm that some instances have experienced a loss of power in a single Availability Zone in the EU-WEST-2 Region. Some EBS volumes within the affected Availability Zone are experiencing degraded performance. We continue to work on resolving the issue. </div><div><span class=\"yellowfg\"> 7:15 PM PST</span>&nbsp;Between 5:33 PM and 7:06 PM PST some instances experienced connectivity issues within a single Availability Zone in the EU-WEST-2 Region. The affected instances did not lose power but became unreachable due to a loss of power to networking devices within the affected Availability Zone. Some EBS volumes experienced degraded performance during this time period and launches of new EC2 instances and the creation of new EBS volumes experienced increased error rates. The issue has been resolved and the service is operating normally. </div>",
        "service": "ec2-eu-west-2"
    }, {
        "service_name": "AWS Lambda (London)",
        "summary": "[RESOLVED] Increased Error Rates",
        "date": "1547258876",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 6:08 PM PST</span>&nbsp;We are investigating increased error rates and elevated latencies for AWS Lambda requests in the EU-WEST-2 Region. Newly created functions and console editing is also affected.</div><div><span class=\"yellowfg\"> 7:19 PM PST</span>&nbsp;Between 5:33 PM and 7:12 PM PST Lambda experienced elevated error rates and latencies in the EU-WEST-2 Region. The issue has been resolved and the service is operating normally</div>",
        "service": "lambda-eu-west-2"
    }, {
        "service_name": "Amazon Relational Database Service (London)",
        "summary": "[RESOLVED] Network Connectivity",
        "date": "1547262903",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 7:15 PM PST</span>&nbsp;We are investigating connectivity issues affecting some instances in a single Availability Zone in the EU-WEST-2 Region.</div><div><span class=\"yellowfg\"> 7:49 PM PST</span>&nbsp;Beginning at 5:33 PM PST, we experienced connectivity issues affecting some database instances in a single Availability Zone in the EU-WEST-2 Region. Connectivity was restored at 7:11 PM PST, at which point the majority of database instances recovered. A small number of Single-AZ databases remain unavailable and we are continuing to work to recover all affected database instances.</div><div><span class=\"yellowfg\"> 8:08 PM PST</span>&nbsp;Between 5:33 PM PST and 7:11 PM PST, we experienced connectivity issues affecting some database instances in a single Availability Zone in the EU-WEST-2 Region. The issue has been resolved and the service is operating normally.</div>",
        "service": "rds-eu-west-2"
    }, {
        "service_name": "Amazon CloudFront",
        "summary": "[RESOLVED] Elevated Lambda@Edge errors",
        "date": "1547501684",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 1:34 PM PST</span>&nbsp;We are investigating elevated Lambda@Edge error rates that may be affecting some customers. CloudFront customers who do not have Lambda@Edge functions are unaffected by this issue. </div><div><span class=\"yellowfg\"> 2:11 PM PST</span>&nbsp;Between 11:40 AM PST and 2:07 PM PST, customers may have experienced elevated Lambda@Edge error rates. CloudFront customers who do not have Lambda@Edge functions were unaffected by this issue. The issue has been resolved and the service is operating normally.</div>",
        "service": "cloudfront"
    }, {
        "service_name": "Amazon Relational Database Service (Ireland)",
        "summary": "[RESOLVED] Increased API error rates",
        "date": "1548423741",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 5:42 AM PST</span>&nbsp;Between 5:03 AM and 5:25 AM PST we experienced increased API error rates and latencies in the EU-WEST-1 Region. The issue has been resolved and the service is operating normally.</div>",
        "service": "rds-eu-west-1"
    }, {
        "service_name": "Amazon Chime",
        "summary": "[RESOLVED] Increased Error Rates",
        "date": "1548450005",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 1:00 PM PST</span>&nbsp;We are investigating contact search latency issues in the US-EAST-1 Region.</div><div><span class=\"yellowfg\"> 1:17 PM PST</span>&nbsp;We are investigating latency in the ability to search contacts, and the inability to add contacts to rooms and calls in the US-EAST-1 Region. Existing users, rooms, and scheduled calls are not impacted.</div><div><span class=\"yellowfg\"> 2:42 PM PST</span>&nbsp;Between 11:38 AM and 2:19 PM PST, we experienced latency in the ability to search contacts, and the inability to add contacts to rooms and calls in the US-EAST-1 Region. The issue has been resolved and the service is operating normally.</div>",
        "service": "chime"
    }, {
        "service_name": "AWS Direct Connect (N. Virginia)",
        "summary": "[RESOLVED] Increased API errors and latencies",
        "date": "1548593864",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 4:57 AM PST</span>&nbsp;We are investigating increased error rates and latencies for AWS Direct Connect APIs in the US-EAST-1 Region.</div><div><span class=\"yellowfg\"> 5:30 AM PST</span>&nbsp;We continue to investigate increased error rates and latencies for AWS Direct Connect APIs in the US-EAST-1 Region.</div><div><span class=\"yellowfg\"> 6:06 AM PST</span>&nbsp;We can confirm increased error rates and latencies for AWS Direct Connect APIs in the US-EAST-1 Region and continue to work towards resolution.</div><div><span class=\"yellowfg\"> 6:31 AM PST</span>&nbsp;Between 4:02 AM and 6:08 AM PST, we experienced increased error rates and latencies for AWS Direct Connect APIs in the US-EAST-1 Region. Connectivity over existing Direct Connect connections was not affected, however, customers may have experienced delays using the Direct Connect console and APIs during this period. The issue has been resolved and the service is operating normally.</div>",
        "service": "directconnect-us-east-1"
    }, {
        "service_name": "AWS Marketplace",
        "summary": "[RESOLVED] Increased Subscription Error Rates ",
        "date": "1549280664",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 3:44 AM PST</span>&nbsp;We are investigating increased AWS Marketplace subscription error rates.</div><div><span class=\"yellowfg\"> 4:34 AM PST</span>&nbsp;Between 1:36 AM and 4:07 AM PST we experienced increased AWS Marketplace subscription error rates. The issue has been resolved and the service is operating normally.</div>",
        "service": "marketplace"
    }, {
        "service_name": "Amazon Relational Database Service (Oregon)",
        "summary": "[RESOLVED] Small Number of Amazon Aurora Instances Unavailable",
        "date": "1549679132",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 6:25 PM PST</span>&nbsp;We are investigating connectivity issues affecting a small number of Amazon Aurora instances in the US-WEST-2 Region.</div><div><span class=\"yellowfg\"> 7:20 PM PST</span>&nbsp;The majority of database instances that experienced connectivity issues in the US-WEST-2 Region have recovered. We are continuing to work to resolve the instances still experiencing connectivity issues.</div><div><span class=\"yellowfg\"> 8:05 PM PST</span>&nbsp;Between 5:14 PM and 7:40 PM PST, we experienced connectivity issues affecting some Amazon Aurora instances in the US-WEST-2 Region. The issue has been resolved and the service is operating normally.</div>",
        "service": "rds-us-west-2"
    }, {
        "service_name": "AWS Identity and Access Management",
        "summary": "[RESOLVED] Increased Error Rates and Latencies",
        "date": "1550029704",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 7:48 PM PST</span>&nbsp;We are investigating increased error rates and latencies for IAM APIs.</div><div><span class=\"yellowfg\"> 8:03 PM PST</span>&nbsp;Between 6:20 PM and 7:49 PM PST, we experienced increased error rates and latencies for IAM APIs. The issue has been resolved and the service is operating normally.</div>",
        "service": "iam"
    }, {
        "service_name": "AWS Elastic Beanstalk (Sydney)",
        "summary": "[RESOLVED] Increased API Failure Rates",
        "date": "1550092874",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 1:21 PM PST</span>&nbsp;We are currently investigating increased error rates to Elastic Beanstalk APIs in the AP-SOUTHEAST-2 Region.</div><div><span class=\"yellowfg\"> 2:11 PM PST</span>&nbsp;We can confirm increased error rates for the Elastic Beanstalk APIs in the AP-SOUTHEAST-2 Region. We have identified the root cause and continue to work toward resolution.</div><div><span class=\"yellowfg\"> 2:31 PM PST</span>&nbsp;Between 12:39 PM and 2:12 PM PST we experienced elevated error rates in the AP-SOUTHEAST-2 Region. The issue has been resolved and the service is operating normally.</div>",
        "service": "elasticbeanstalk-ap-southeast-2"
    }, {
        "service_name": "Amazon Relational Database Service (Sydney)",
        "summary": "[RESOLVED] Increased Create Times and Cluster Unavailability",
        "date": "1550094163",
        "status": "1",
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 1:42 PM PST</span>&nbsp;We are investigating increased database create times and cluster unavailability for Amazon Aurora in the AP-SOUTHEAST-2 Region.</div><div><span class=\"yellowfg\"> 2:09 PM PST</span>&nbsp;We can confirm increased database create times and cluster unavailability for Amazon Aurora in the AP-SOUTHEAST-2 Region. We have identified the root cause and continue to work toward resolution.</div><div><span class=\"yellowfg\"> 2:49 PM PST</span>&nbsp;We have resolved the issue resulting in increased database create times, and continue to work toward full resolution on Amazon Aurora Cluster Availability.</div><div><span class=\"yellowfg\"> 4:06 PM PST</span>&nbsp;We are beginning to see recovery for some Amazon Aurora Clusters and continue to work toward full resolution.</div><div><span class=\"yellowfg\"> 6:11 PM PST</span>&nbsp;Beginning at 11:54 AM PST some Amazon Aurora clusters experienced increased database create times and cluster unavailability in the AP-SOUTHEAST-2 Region. Elevated create times were resolved at 2:27 PM PST, at which point some existing clusters continued to experience availability issues. As of 5:35 PM PST both issues have been resolved and the service is operating normally. In total, the event impacted a little less than 3% of the Aurora databases in the region.</div>",
        "service": "rds-ap-southeast-2"
    }, {
        "service_name": "Amazon Relational Database Service (Montreal)",
        "summary": "[RESOLVED] Increased Create Times and Cluster Unavailability",
        "date": "1550107156",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 5:19 PM PST</span>&nbsp;We wanted to provide an update for Amazon Aurora in the CA-CENTRAL-1 Region that we previously communicated to affected customers on their Personal Health Dashboards. Beginning at 11:43 AM PST some Amazon Aurora clusters experienced increased database create times and cluster unavailability in the CA-CENTRAL-1 Region. Elevated create times were resolved at 2:14 PM PST, at which point some existing clusters continued to experience availability issues. As of 4:48 PM PST both issues have been resolved and the service is operating normally.</div>",
        "service": "rds-ca-central-1"
    }, {
        "service_name": "Amazon Route 53",
        "summary": "[RESOLVED] Increased Change Propagation Time ",
        "date": "1550635211",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 8:00 PM PST</span>&nbsp;We are investigating increased propagation times of DNS edits to Route 53 DNS servers. Queries to existing DNS records are not affected by this issue and are being answered normally.</div><div><span class=\"yellowfg\"> 8:19 PM PST</span>&nbsp;We continue to investigate increased propagation times of DNS edits to the Route 53 DNS servers. This issue will also affect provisioning of services such as EFS, ElasticBeanstalk, CloudFormation, and Amazon MQ. Queries to existing DNS records are not affected by this issue. </div><div><span class=\"yellowfg\"> 8:51 PM PST</span>&nbsp;Between 7:34 PM and 8:45 PM PST we experienced increased propagation times of DNS edits. Queries to existing DNS records were not affected by this issue. The issue has been resolved and the service is operating normally.</div>",
        "service": "route53"
    }, {
        "service_name": "Amazon Chime",
        "summary": "[RESOLVED] Availability ",
        "date": "1550790706",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 3:11 PM PST</span>&nbsp;We are investigating meeting and chat availability issues.</div><div><span class=\"yellowfg\"> 3:45 PM PST</span>&nbsp;We continue to investigate meeting and chat availability issues. </div><div><span class=\"yellowfg\"> 4:41 PM PST</span>&nbsp;We have identified the root cause of meeting and chat availability issues and continue to work toward resolution.</div><div><span class=\"yellowfg\"> 5:19 PM PST</span>&nbsp;Between 2:51 PM and 5:04 PM PST we experienced meeting and chat availability issues. The issue has been resolved and the service is operating normally.</div>",
        "service": "chime"
    }, {
        "service_name": "AWS Certificate Manager (N. Virginia)",
        "summary": "[RESOLVED] Increased Error Rates",
        "date": "1551126347",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\">12:25 PM PST</span>&nbsp;We are experiencing increased error rates for AWS Certificate Manager in the US-EAST-1 Region.</div><div><span class=\"yellowfg\">12:59 PM PST</span>&nbsp;We can confirm increased error rates for AWS Certificate Manager in the US-EAST-1 Region. We have identified the root cause and are working toward resolution.</div><div><span class=\"yellowfg\"> 1:50 PM PST</span>&nbsp;Between 11:48 AM and 1:26 PM PST, we experienced increased error rates for AWS Certificate Manager in the US-EAST-1 Region. The issue has been resolved and the service is operating normally.</div>",
        "service": "certificatemanager-us-east-1"
    }, {
        "service_name": "Amazon CloudFront",
        "summary": "[RESOLVED] Change Propagation Delays",
        "date": "1551301596",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 1:06 PM PST</span>&nbsp;Weâ€™re investigating longer than usual propagation times for changes to CloudFront configurations. End-user requests for content from our edge locations are not affected by this issue and are being served normally.</div><div><span class=\"yellowfg\"> 1:30 PM PST</span>&nbsp;Between 10:09 AM and 1:23 PM PST customers may have experienced longer than usual propagation times while making changes to CloudFront configurations. End-user requests for content from edge locations were not affected. The issue has been resolved and the service is operating normally.</div>",
        "service": "cloudfront"
    }, {
        "service_name": "Amazon Elastic Container Service (Ireland)",
        "summary": "[RESOLVED] Elevated API Error Rates",
        "date": "1551383330",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\">11:49 AM PST</span>&nbsp;We are investigating elevated API error rates in the EU-WEST-1 Region.</div><div><span class=\"yellowfg\">12:30 PM PST</span>&nbsp;Between 11:05 AM and 12:05 PM PST we experienced elevated API error rates in the EU-WEST-1 Region. The issue has been resolved and the service is operating normally.</div>",
        "service": "ecs-eu-west-1"
    }, {
        "service_name": "Amazon Elastic Compute Cloud (N. Virginia)",
        "summary": "[RESOLVED] Increased Launch Failures",
        "date": "1551977827",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 8:57 AM PST</span>&nbsp;Between 5:40 AM and 8:20 AM PST, new launches of EC2 instances were erroneously disabled in a single Availability Zone within the US-EAST-1 Region. This caused new launches to fail when targeting the affected Availability Zone and also resulted in health checks reporting instances in the affected Availability Zone as impaired. Customers with Auto Scaling Groups configured to replace instances on impaired EC2 health checks may have had instances replaced as a result of this issue. The Availability Zone has been re-enabled for new launches and Auto Scaling has automatically replaced affected instances. The issue has been resolved and the service is operating normally.</div>",
        "service": "ec2-us-east-1"
    }, {
        "service_name": "Amazon WorkSpaces (N. Virginia)",
        "summary": "[RESOLVED] Increased Error Rates",
        "date": "1552347514",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 4:38 PM PDT</span>&nbsp;We are investigating increased errors when calling WorkSpaces APIs and connecting to WorkSpaces in the US-EAST-1 Region.</div><div><span class=\"yellowfg\"> 5:39 PM PDT</span>&nbsp;Between 3:35 PM and 4:57 PM PDT we experienced increased API error rates and connection errors to WorkSpaces in the US-EAST-1 Region. The issue has been resolved and the service is operating normally.</div>",
        "service": "workspaces-us-east-1"
    }, {
        "service_name": "Amazon DynamoDB (N. Virginia)",
        "summary": "[RESOLVED] Latencies in DynamoDB control plane operations",
        "date": "1552426531",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 2:35 PM PDT</span>&nbsp;We are currently investigating increased latencies on create, update, and delete table operations with Amazon DynamoDB in the US-EAST-1 Region.</div><div><span class=\"yellowfg\"> 3:12 PM PDT</span>&nbsp;We have identified the cause of increased latencies on create, update, and delete table operations with Amazon DynamoDB in the US-EAST-1 Region and continue working towards resolution.</div><div><span class=\"yellowfg\"> 3:52 PM PDT</span>&nbsp;We continue to work on resolution for create, update, and delete table operations with Amazon DynamoDB in the US-EAST-1 Region.</div><div><span class=\"yellowfg\"> 4:05 PM PDT</span>&nbsp;New requests to create, update, and delete tables with Amazon DynamoDB are processing normally in the US-EAST-1 Region. We continue to work towards resolution for backlogged requests.</div><div><span class=\"yellowfg\"> 4:20 PM PDT</span>&nbsp;Between 1:15 PM and 4:14 PM PDT, we experienced increased latencies on create, update, and delete table operations with Amazon DynamoDB in the US-EAST-1 Region. The issue has been resolved and the service is operating normally.</div>",
        "service": "dynamodb-us-east-1"
    }, {
        "service_name": "Amazon Elastic Compute Cloud (Oregon)",
        "summary": "[RESOLVED] Increased API Error Rates",
        "date": "1552507000",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\">12:56 PM PDT</span>&nbsp;We are investigating increased API error rates and launch failures in the US-WEST-2 Region.</div><div><span class=\"yellowfg\"> 1:13 PM PDT</span>&nbsp;Between 12:29 PM and 12:56 PM PDT, we experienced increased API error rates and launch failures in the US-WEST-2 Region. The issue has been resolved and the service is operating normally. </div>",
        "service": "ec2-us-west-2"
    }, {
        "service_name": "AWS Management Console",
        "summary": "[RESOLVED] Increased Error Rates",
        "date": "1553118849",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 2:54 PM PDT</span>&nbsp;We are investigating increased error rates and latencies for the AWS Management Console in the EU-WEST-3 Region.</div><div><span class=\"yellowfg\"> 3:18 PM PDT</span>&nbsp;Between 2:13 PM and 3:08 PM PDT we experienced increased error rates and latencies for the AWS Management Console in the EU-WEST-3 Region. The issue has been resolved and the service is operating normally. </div>",
        "service": "management-console"
    }, {
        "service_name": "Amazon Elastic Compute Cloud (N. Virginia)",
        "summary": "[RESOLVED] Increased API Error Rates and Launch Failures",
        "date": "1553278711",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\">11:18 AM PDT</span>&nbsp;We are investigating increased API error rates and launch failures in a single Availability Zone in the US-EAST-1 Region. Existing instances are not affected.</div><div><span class=\"yellowfg\">12:06 PM PDT</span>&nbsp;We continue to investigate increased API error rates and launch failures in a single Availability Zone in the US-EAST-1 Region. Existing instances are not affected.</div><div><span class=\"yellowfg\">12:44 PM PDT</span>&nbsp;We continue to investigate increased API error rates and launch failures in a single Availability Zone in the US-EAST-1 Region. Existing instances are not affected.</div><div><span class=\"yellowfg\"> 1:11 PM PDT</span>&nbsp;Between 9:28 AM and 12:52 PM PDT we experienced increased API error rates and launch failures in a single Availability Zone in the US-EAST-1 Region. Existing instances were not affected. The issue has been resolved and the service is operating normally.</div>",
        "service": "ec2-us-east-1"
    }, {
        "service_name": "Amazon CloudWatch (Oregon)",
        "summary": "[RESOLVED] Delayed Metrics",
        "date": "1553710396",
        "status": 2,
        "details": "",
        "description": "<div><span class=\"yellowfg\">11:14 AM PDT</span>&nbsp;We are investigating increased delays for CloudWatch metrics in the US-WEST-2 Region. CloudWatch alarms may transition into \"INSUFFICIENT_DATA\" state if set on delayed metrics.</div><div><span class=\"yellowfg\">11:33 AM PDT</span>&nbsp;We can confirm increased connection errors and latencies for CloudWatch APIs. Some CloudWatch metrics are delayed. We are actively working to resolve the issue.</div><div><span class=\"yellowfg\">12:30 PM PDT</span>&nbsp;We have identified the root cause of the increased connection errors and latencies for CloudWatch APIs, as well as the CloudWatch metric delays. We continue to work toward recovery.</div><div><span class=\"yellowfg\">12:45 PM PDT</span>&nbsp;We are beginning to see recovery and continue to work toward full recovery. </div><div><span class=\"yellowfg\"> 1:03 PM PDT</span>&nbsp;Between 10:40 AM and 12:44 PM PDT we experienced increased connection errors and latencies for CloudWatch APIs. During this time CloudWatch alarms may have transitioned into \"INSUFFICIENT_DATA\" state if set on delayed metrics. The issue has been resolved and the service is operating normally. </div>",
        "service": "cloudwatch-us-west-2"
    }, {
        "service_name": "AWS Certificate Manager (Oregon)",
        "summary": "[RESOLVED] Increased Error Rates",
        "date": "1553712991",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\">11:57 AM PDT</span>&nbsp;We are investigating increased connection errors and latencies for the ACM APIs and ACM Management Console in the US-WEST-2 Region. </div><div><span class=\"yellowfg\">12:34 PM PDT</span>&nbsp;We have identified the root cause of the increased connection errors and latencies for the ACM APIs and ACM Management Console in the US-WEST-2 Region. We are beginning to see recovery and continue to work toward full resolution.</div><div><span class=\"yellowfg\">12:50 PM PDT</span>&nbsp;Between 10:40 AM and 12:40 PM PDT we experienced increased connection errors and latencies for the ACM APIs and ACM Management Console in the US-WEST-2 Region. The issue has been resolved and the service is operating normally. </div>",
        "service": "certificatemanager-us-west-2"
    }, {
        "service_name": "Auto Scaling (Oregon)",
        "summary": "[RESOLVED] API Faults and Latencies",
        "date": "1553715184",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\">12:33 PM PDT</span>&nbsp;We are investigating increased elevated faults and latencies across the DescribePolicies, PutScalingPolicy and RegisterScalableTarget APIs in the US-WEST-2 Region.</div><div><span class=\"yellowfg\">12:54 PM PDT</span>&nbsp;Between 10:40 AM and 12:40 PM PDT we experienced increased elevated faults and latencies across the DescribePolicies, PutScalingPolicy and RegisterScalableTarget APIs in the US-WEST-2 Region. The issue has been resolved and the service is operating normally.</div>",
        "service": "autoscaling-us-west-2"
    }, {
        "service_name": "AWS Lambda (Oregon)",
        "summary": "[RESOLVED] Increased API Error Rates",
        "date": "1553757070",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\">12:11 AM PDT</span>&nbsp;We are investigating increased API error rates in the US-WEST-2 Region. </div><div><span class=\"yellowfg\">12:52 AM PDT</span>&nbsp;We have identified the root cause of the issue causing increased API latencies and errors in the US-WEST-2 Region and continue to work toward resolution.</div><div><span class=\"yellowfg\"> 2:21 AM PDT</span>&nbsp;We continue to see recovery in error rates for AWS Lambda API requests in the US-WEST-2 Region. Some customers may still experience errors in new function creation, updating existing functions and console editing. We continue to work towards full resolution. </div><div><span class=\"yellowfg\"> 2:46 AM PDT</span>&nbsp;Between March 27 11:20 PM and March 28 2:35 AM PDT, AWS Lambda experienced API latencies and errors in the US-WEST-2 Region. The issue has been resolved and the service is operating normally. </div>",
        "service": "lambda-us-west-2"
    }, {
        "service_name": "Amazon API Gateway (Oregon)",
        "summary": "[RESOLVED] Increased Error Rates",
        "date": "1553757540",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\">12:19 AM PDT</span>&nbsp;We are investigating increased error rates for Lambda integrations and Lambda Authorizers for invokes in the US-WEST-2 Region.</div><div><span class=\"yellowfg\">12:58 AM PDT</span>&nbsp;We have identified the root cause of the issue causing increased error rates for Lambda integrations and Lambda Authorizers for invokes in the US-WEST-2 Region and continue to work toward resolution.</div><div><span class=\"yellowfg\"> 2:36 AM PDT</span>&nbsp;Between March 27 11:20 PM and March 28 2:23 AM PDT customers using Lambda with API Gateway for Integrations and Authorizers experienced elevated API error rates in the US-WEST-2 Region. The issue has been resolved and the service is operating normally.</div>",
        "service": "apigateway-us-west-2"
    }, {
        "service_name": "AWS Resource Access Manager (Oregon)",
        "summary": "[RESOLVED] API Latencies and Error Rate",
        "date": "1553757596",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\">12:20 AM PDT</span>&nbsp;We are investigating increased API latencies and error rates in the US-WEST-2 Region.</div><div><span class=\"yellowfg\">12:55 AM PDT</span>&nbsp;We have identified the root cause of the issue causing increased API latencies and errors in the US-WEST-2 Region and continue to work toward resolution.</div><div><span class=\"yellowfg\"> 2:36 AM PDT</span>&nbsp;\r\nBetween March 27 11:15 PM and March 28 1:49 AM PDT, we experienced increased API error rates and latencies in the US-WEST-2 Region. The issue has been resolved and the service is operating normally.</div>",
        "service": "ram-us-west-2"
    }, {
        "service_name": "AWS Batch (Oregon)",
        "summary": "[RESOLVED] Increased Error Rates",
        "date": "1553757962",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\">12:26 AM PDT</span>&nbsp;We are investigating increased error rates for API calls in the US-WEST-2 Region. Compute Resource connectivity and running jobs are not affected.</div><div><span class=\"yellowfg\">12:57 AM PDT</span>&nbsp;We have identified the root cause of increased error rates for API calls in the US-WEST-2 Region. Compute Resource connectivity and running jobs are not affected.</div><div><span class=\"yellowfg\"> 2:14 AM PDT</span>&nbsp;We have identified the root cause of increased error rates for API calls in the US-WEST-2 Region impacting new API calls. Compute Resource connectivity and running jobs are not affected. We continue to work towards recovery. </div><div><span class=\"yellowfg\"> 2:39 AM PDT</span>&nbsp;Between March 27 11:21 PM and March 28 2:18 AM PDT, AWS Batch experienced increased error rates for API calls in the US-WEST-2 Region. Compute Resource connectivity and running jobs were not affected. The issue has been resolved and the service is operating normally. </div>",
        "service": "batch-us-west-2"
    }, {
        "service_name": "AWS AppSync (Oregon)",
        "summary": "[RESOLVED] Increased Error Rates",
        "date": "1553758789",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\">12:40 AM PDT</span>&nbsp;We are investigating increased API error rates in the US-WEST-2 Region. </div><div><span class=\"yellowfg\"> 1:14 AM PDT</span>&nbsp;We have identified the root cause of the issue causing increased API error rates in the US-WEST-2 Region and continue to work toward resolution. </div><div><span class=\"yellowfg\"> 2:40 AM PDT</span>&nbsp;Between March 27 11:20 PM and March 28 1:57 AM PDT, we experienced increased API error rates for the US-WEST-2 Region. The issue has been resolved and the service is operating normally.</div>",
        "service": "appsync-us-west-2"
    }, {
        "service_name": "AWS Certificate Manager (N. Virginia)",
        "summary": "[RESOLVED] Increased API Error Rates",
        "date": "1553876764",
        "status": 2,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 9:26 AM PDT</span>&nbsp;We are investigating increased API error rates in the US-EAST-1 Region.</div><div><span class=\"yellowfg\"> 9:46 AM PDT</span>&nbsp;We continue to investigate increased API error rates in the US-EAST-1 Region.</div><div><span class=\"yellowfg\">10:18 AM PDT</span>&nbsp;We have identified the root cause of the increased API error rates in the US-EAST-1 Region. We continue to work toward resolution.</div><div><span class=\"yellowfg\">11:28 AM PDT</span>&nbsp;We are beginning to see recovery for the increased API error rates in the US-EAST-1 Region. We continue to work toward full recovery.</div><div><span class=\"yellowfg\">11:53 AM PDT</span>&nbsp;Between 8:41 AM and 11:10 AM PDT we experienced increased API error rates in the US-EAST-1 Region. The issue has been resolved and the service is operating normally.</div>",
        "service": "certificatemanager-us-east-1"
    }, {
        "service_name": "Amazon CloudFront",
        "summary": "[RESOLVED] Change Propagation Delays",
        "date": "1553885279",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\">11:48 AM PDT</span>&nbsp;Weâ€™re investigating longer than usual propagation times for changes to CloudFront configurations. End-user requests for content from our edge locations are not affected by this issue and are being served normally.</div><div><span class=\"yellowfg\">12:52 PM PDT</span>&nbsp;We have identified the root cause of the longer than usual propagation times for changes to CloudFront configurations. We continue to work toward resolution. </div><div><span class=\"yellowfg\"> 1:18 PM PDT</span>&nbsp;Between 8:50 AM and 12:59 PM PDT, we experienced longer than usual propagation times for changes to CloudFront configurations. The issue has been resolved and the service is operating normally.</div>",
        "service": "cloudfront"
    }, {
        "service_name": "AWS Lambda (Ireland)",
        "summary": "[RESOLVED] Increased Async API Latencies",
        "date": "1554044749",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 8:06 AM PDT</span>&nbsp;We are investigating increased Async API latencies in the EU-WEST-1 Region.</div><div><span class=\"yellowfg\"> 8:41 AM PDT</span>&nbsp;We have identified the root cause of increased Async API latencies in the EU-WEST-1 Region and continue to work toward resolution.</div><div><span class=\"yellowfg\"> 9:32 AM PDT</span>&nbsp;Between 6:59 AM and 8:56 AM PDT we experienced increased latencies for the Lambda Async API in the EU-WEST-1 Region. The issue has been resolved and the service is operating normally.</div>",
        "service": "lambda-eu-west-1"
    }, {
        "service_name": "AWS IoT Core (Ireland)",
        "summary": "[RESOLVED] Increased API Errors and Latencies",
        "date": "1554201606",
        "status": 2,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 3:40 AM PDT</span>&nbsp;We are investigating increased API error rates when establishing new connections to AWS IoT Core in the EU-WEST-1 Region.</div><div><span class=\"yellowfg\"> 4:23 AM PDT</span>&nbsp;Between 1:52 AM and 3:35 AM PDT we experienced increased API error rates and latencies in the EU-WEST-1 Region. The issue has been resolved and the service is operating normally.</div>",
        "service": "awsiot-eu-west-1"
    }, {
        "service_name": "Amazon Chime",
        "summary": "[RESOLVED] Authentication Availability",
        "date": "1554263486",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 8:51 PM PDT</span>&nbsp;We are investigating availability issues with authenticating using Active Directory in the US-EAST-1 Region.</div><div><span class=\"yellowfg\"> 9:27 PM PDT</span>&nbsp;Between 6:30 PM and 9:10 PM PDT we experienced increased Active Directory authentication failures in the US-EAST-1 Region. The issue has been resolved and the service is operating normally. </div>",
        "service": "chime"
    }, {
        "service_name": "Amazon Elastic Compute Cloud (US-East)",
        "summary": "[RESOLVED] Network Connectivity ",
        "date": "1554336479",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 5:08 PM PDT</span>&nbsp;We are investigating internet connectivity issues in the US-GOV-EAST-1 Region.</div><div><span class=\"yellowfg\"> 5:27 PM PDT</span>&nbsp;We can confirm Internet and EC2 Public IP address connectivity issues for newly launched EC2 instances within the US-GOV-EAST-1 Region. Connectivity for existing instances is not affected.</div><div><span class=\"yellowfg\"> 5:59 PM PDT</span>&nbsp;Between 3:29 PM and 5:50 PM PDT some newly launched instances experienced Internet and EC2 Public IP address connectivity issues in the US-GOV-EAST-1 Region. The issue has been resolved and the service is operating normally.</div>",
        "service": "ec2-us-gov-east-1"
    }, {
        "service_name": "AWS CodeBuild (N. Virginia)",
        "summary": "[RESOLVED] Increased Error Rates ",
        "date": "1554742713",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 9:58 AM PDT</span>&nbsp;We are investigating increased API and Build error rates in the US-EAST-1 Region. </div><div><span class=\"yellowfg\">10:23 AM PDT</span>&nbsp;We have identified the cause of the increased error rates for the CodeBuild Management Console and Build APIs in the US-EAST-1 Region and continue to work towards resolution. </div><div><span class=\"yellowfg\">10:34 AM PDT</span>&nbsp;Between 8:35 AM and 10:05 AM PDT we experienced increased error rates for the CodeBuild Management Console and Build APIs in the US-EAST-1 Region. The issue has been resolved and the service is operating normally. </div>",
        "service": "codebuild-us-east-1"
    }, {
        "service_name": "Amazon Elastic Load Balancing (N. Virginia)",
        "summary": "[RESOLVED] Increased API Error Rates",
        "date": "1554964842",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\">11:40 PM PDT</span>&nbsp;We are investigating increased error rates and latencies for the ELB APIs in the US-EAST-1 Region.</div><div><span class=\"yellowfg\">Apr 11, 12:07 AM PDT</span>&nbsp;Between 11:13 PM and 11:54 PM PDT we experienced increased error rates and latencies for the ELB APIs in the US-EAST-1 Region. Connectivity to existing load balancers was not affected. The issue has been resolved and the service is operating normally.</div>",
        "service": "elb-us-east-1"
    }, {
        "service_name": "Amazon Route 53",
        "summary": "[RESOLVED] Elevated Route 53 API error rates ",
        "date": "1555178246",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\">10:57 AM PDT</span>&nbsp;We are currently investigating elevated error rates for some Route 53 API calls in the US-EAST-1 Region. There is no impact to answering DNS queries and they continue to work normally.</div><div><span class=\"yellowfg\">11:22 AM PDT</span>&nbsp;Between 10:13 AM and 10:58 AM PDT we experienced intermittent elevated error rates for some Route 53 API calls in the US-EAST-1 Region. There was no impact to answering DNS queries throughout this time. The issue has been resolved and the service is operating normally</div>",
        "service": "route53"
    }, {
        "service_name": "Amazon Elastic Compute Cloud (Sao Paulo)",
        "summary": "[RESOLVED] Increased API Error Rates",
        "date": "1555527672",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\">12:01 PM PDT</span>&nbsp;We are investigating increased RunInstance API error rates in the SA-EAST-1 Region.</div><div><span class=\"yellowfg\">12:21 PM PDT</span>&nbsp;Between 11:30 AM and 12:09 PM PDT we experienced increased RunInstance API error rates and latencies in the SA-EAST-1 Region. The issue has been resolved and the service is operating normally.</div>",
        "service": "ec2-sa-east-1"
    }, {
        "service_name": "AWS Billing Console",
        "summary": "[RESOLVED] Increased Billing Console Error Rates",
        "date": "1555578361",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 2:06 AM PDT</span>&nbsp;We are investigating increased error rates in the Billing Console.</div><div><span class=\"yellowfg\"> 2:56 AM PDT</span>&nbsp;We continue to investigate intermittent availability and increased error rates in the Billing Console.</div><div><span class=\"yellowfg\"> 3:53 AM PDT</span>&nbsp;We continue to investigate intermittent availability and increased error rates in the Billing Console and are working towards resolution. </div><div><span class=\"yellowfg\"> 4:45 AM PDT</span>&nbsp;We have identified the cause of the intermittent availability issues and increased error rates in the Billing Console and continue working towards resolution.</div><div><span class=\"yellowfg\"> 5:17 AM PDT</span>&nbsp;Between 2:06 AM and 5:00 AM PDT we experienced intermittent availability issues and increased error rates in the Billing Console. The issue has been resolved and the service is operating normally.</div>",
        "service": "billingconsole"
    }, {
        "service_name": "AWS Management Console (US-East)",
        "summary": "Increased Console Error Rates",
        "date": "1556210519",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 3:20 AM PDT</span>&nbsp;We are investigating increased error rates when loading the AWS Management Console.</div>",
        "service": "management-console-us-gov-east-1"
    }, {
        "service_name": "AWS Management Console",
        "summary": "[RESOLVED] Increased Console Error Rates",
        "date": "1556210754",
        "status": 2,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 9:50 AM PDT</span>&nbsp;We are currently investigating increased errors for loading the AWS Management Console. Alternate link is available at: <a href=\"https://us-west-2.console.aws.amazon.com/ec2/v2/home\">https://us-west-2.console.aws.amazon.com/ec2/v2/home</a></div><div><span class=\"yellowfg\">10:10 AM PDT</span>&nbsp;We can confirm impact to the AWS Management Console in US-EAST-1 specific to the /home link. AWS services are not impacted, and access to service-specific consoles is working normally. Please use alternate link: <a href=\"https://us-west-2.console.aws.amazon.com/ec2/v2/home\">https://us-west-2.console.aws.amazon.com/ec2/v2/home</a></div><div><span class=\"yellowfg\">11:28 AM PDT</span>&nbsp;We continue to work towards resolution in US-EAST-1 for issues specific to the /home Management Console link. AWS services are not impacted, and access to service-specific consoles is working normally. Please use alternate link: <a href=\"https://us-east-1.console.aws.amazon.com/ec2/v2/home\">https://us-east-1.console.aws.amazon.com/ec2/v2/home</a> and select a service from the Services menu above.</div><div><span class=\"yellowfg\">12:18 PM PDT</span>&nbsp;Between 9:11 AM and 12:13 PM PDT we experienced increased error rates for the AWS Management Console in the US-EAST-1 Region. The issue has been resolved and the service is operating normally. </div>",
        "service": "management-console"
    }, {
        "service_name": "AWS Single Sign-On (N. Virginia)",
        "summary": "[RESOLVED] Single Sign-On",
        "date": "1556215997",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\">11:13 AM PDT</span>&nbsp;We can confirm impact to the AWS SSO user portal specific to single-sign on to the AWS Management Console. SAML assertions are not impacted but users may be directed to a website unavailable page when authenticating with SAML. Please use alternate link: <a href=\"https://us-west-2.console.aws.amazon.com/ec2/v2/home\">https://us-west-2.console.aws.amazon.com/ec2/v2/home</a> after authenticating. There is no impact to application sign-in.</div><div><span class=\"yellowfg\">11:43 AM PDT</span>&nbsp;We continue to work towards resolution for issues specific to the AWS Management Console. For SSO customers who are seeing an error message while attempting to sign into AWS console through the AWS SSO User Portal, clicking on â€œlogin againâ€ provides access</div><div><span class=\"yellowfg\">12:18 PM PDT</span>&nbsp;Between 9:11 AM and 12:13 PM PDT we experienced increased error rates for the AWS Management Console in the US-EAST-1 Region. The issue has been resolved and the service is operating normally. </div>",
        "service": "sso-us-east-1"
    }, {
        "service_name": "Amazon Simple Storage Service (N. Virginia)",
        "summary": "[RESOLVED]  Increased Error Rates ",
        "date": "1556557390",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\">10:03 AM PDT</span>&nbsp;We are investigating increased error rates for Amazon S3 GET and PUT requests in the US-EAST-1 Region.</div><div><span class=\"yellowfg\">10:32 AM PDT</span>&nbsp;We have identified the cause of the increased error rates in the US-EAST-1 Region and are working towards resolution.</div><div><span class=\"yellowfg\">10:42 AM PDT</span>&nbsp;Between 9:18 AM and 10:18 AM PDT we experienced slightly increased GET and PUT error rates for Amazon S3 requests in the US-EAST-1 Region. The issue has been resolved and the service is operating normally.</div>",
        "service": "s3-us-standard"
    }, {
        "service_name": "Amazon CloudFront",
        "summary": "[RESOLVED] Increased Error Rates",
        "date": "1556576555",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 3:22 PM PDT</span>&nbsp;We are investigating increased error rates for requests served by certain edge locations in South East Asia.</div><div><span class=\"yellowfg\"> 3:59 PM PDT</span>&nbsp;Between 2:16 PM and 3:43 PM PDT we experienced increased error rates for requests served by edge locations in South East Asia. The issue has been resolved and the service is operating normally.</div>",
        "service": "cloudfront"
    }, {
        "service_name": "Amazon Elastic Compute Cloud (Sydney)",
        "summary": "[RESOLVED] Network Connectivity",
        "date": "1556589414",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 6:57 PM PDT</span>&nbsp;We are investigating network connectivity issues for some non-Nitro instances in a single Availability Zone in the AP-SOUTHEAST-2 Region.</div><div><span class=\"yellowfg\"> 7:35 PM PDT</span>&nbsp;We can confirm network connectivity issues for some non-Nitro instances in a single Availability Zone in the AP-SOUTHEAST-2 Region. Connectivity for affected instances can be restored using a stop/start command from the EC2 Management Console or EC2 API. We continue to work towards restoring network connectivity for the affected instances.</div><div><span class=\"yellowfg\"> 8:36 PM PDT</span>&nbsp;We have resolved the network connectivity issue affecting some non-Nitro instances in a single Availability Zone in the AP-SOUTHEAST-2 Region. For instances that are still experiencing connectivity issues, we recommend issuing a reboot or stop/start command from the EC2 Management Console or EC2 API. The issue has been resolved and the service is operating normally.</div>",
        "service": "ec2-ap-southeast-2"
    }, {
        "service_name": "Amazon Elastic Compute Cloud (Hong Kong)",
        "summary": "[RESOLVED] EC2 Recursive DNS Resolution Issues",
        "date": "1556669136",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 5:06 PM PDT</span>&nbsp;We are investigating DNS resolution issues in a single Availability Zone in the AP-EAST-1 Region.</div><div><span class=\"yellowfg\"> 5:23 PM PDT</span>&nbsp;We are investigating DNS resolution issues, increased API error rates, and error rates for new launches in the AP-EAST-1 Region.</div><div><span class=\"yellowfg\"> 6:04 PM PDT</span>&nbsp;Between 4:39 PM and 5:50 PM PDT we experienced DNS resolution issues, increased API error rates, impaired instances, and error rates for new launches in the AP-EAST-1 Region. The issue has been resolved and the service is operating normally.</div>",
        "service": "ec2-ap-east-1"
    }, {
        "service_name": "Amazon Simple Queue Service (Ohio)",
        "summary": "[RESOLVED]  Increased Error Rates ",
        "date": "1556905071",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\">10:38 AM PDT</span>&nbsp;We are investigating increased error rates in the US-EAST-2 Region.</div><div><span class=\"yellowfg\">11:18 AM PDT</span>&nbsp;Between 10:14 AM and 11:09 AM PDT, we experienced elevated API error rates in the US-EAST-2 Region. We have resolved the issue and the service is operating normally.</div>",
        "service": "sqs-us-east-2"
    }, {
        "service_name": "AWS Lambda (Ohio)",
        "summary": "[RESOLVED] Increased Error Rates",
        "date": "1556906015",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\">10:53 AM PDT</span>&nbsp;We are investigating increased error rates and latency in the US-EAST-2 Region.</div><div><span class=\"yellowfg\">11:54 AM PDT</span>&nbsp;We have identified the cause of increased error rates and latency in the US-EAST-2 Region and are working towards resolution. </div><div><span class=\"yellowfg\">12:28 PM PDT</span>&nbsp;Between 10:14 AM and 12:25 PM PDT, we experienced elevated API error rates in the US-EAST-2 Region. We have resolved the issue and the service is operating normally.</div>",
        "service": "lambda-us-east-2"
    }, {
        "service_name": "Amazon CloudWatch (Ohio)",
        "summary": "[RESOLVED] Increased Error Rates",
        "date": "1556906325",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\">10:58 AM PDT</span>&nbsp;We are investigating increased error rates and delays for CloudWatch Logs Insights queries in the US-EAST-2 Region.</div><div><span class=\"yellowfg\">11:15 AM PDT</span>&nbsp;Between 10:14 AM and 11:09 AM PDT, we experienced elevated error rates and delays when running CloudWatch Logs Insights queries in the US-EAST-2 Region. We have resolved the issue and the service is operating normally.</div>",
        "service": "cloudwatch-us-east-2"
    }, {
        "service_name": "AWS IoT Core (Ohio)",
        "summary": "[RESOLVED] Increased Error Rates",
        "date": "1556906633",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\">11:04 AM PDT</span>&nbsp;AWS IoT Core is investigating increased error rates and latency in the US-EAST-2 Region.</div><div><span class=\"yellowfg\">11:24 AM PDT</span>&nbsp;Between 10:14 AM and 11:09 AM PDT, we experienced elevated error rates and increased latency when trying to Connect to and Publish Messages on AWS IoT Core in the US-EAST-2 Region. We have resolved the issue and the service is operating normally.</div>",
        "service": "awsiot-us-east-2"
    }, {
        "service_name": "AWS Elastic Beanstalk (Ireland)",
        "summary": "[RESOLVED] Increased API Error Rates ",
        "date": "1557476843",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 1:27 AM PDT</span>&nbsp;We are currently investigating increased error rates for the Elastic Beanstalk APIs in the EU-WEST-1 Region.</div><div><span class=\"yellowfg\"> 2:15 AM PDT</span>&nbsp;We have identified the root cause of increased error rates to Elastic Beanstalk APIs in the EU-WEST-1 Region and continue to work towards resolution.</div><div><span class=\"yellowfg\"> 2:27 AM PDT</span>&nbsp;Between 12:43 AM and 1:24 AM PDT, we experienced increased error rates in the EU-WEST-1 Region. The issue has been resolved and the service is operating normally.</div>",
        "service": "elasticbeanstalk-eu-west-1"
    }, {
        "service_name": "Amazon Relational Database Service (Ireland)",
        "summary": "[RESOLVED] Increased API Error Rates and Connectivity Issues",
        "date": "1557477953",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 1:46 AM PDT</span>&nbsp;We are investigating increased API error rates in the EU-WEST-1 Region.</div><div><span class=\"yellowfg\"> 2:14 AM PDT</span>&nbsp;We are investigating increased API error rates and connectivity issues for some Aurora MySQL instances in the EU-WEST-1 Region.</div><div><span class=\"yellowfg\"> 2:34 AM PDT</span>&nbsp;We have identified the root cause of increased API error rates and connectivity issues for some Aurora MySQL instances in the EU-WEST-1 Region and continue to work towards resolution.</div><div><span class=\"yellowfg\"> 4:09 AM PDT</span>&nbsp;Beginning at 12:43 AM PDT we experienced increased API error rates and connectivity issues for some Aurora MySQL instances in the EU-WEST-1 Region. Elevated API error rates were resolved at 1:33 AM PDT, at which point some existing clusters continued to experience connectivity issues. As of 3:50 AM PDT both issues have been resolved and the service is operating normally.</div>",
        "service": "rds-eu-west-1"
    }, {
        "service_name": "Amazon Route 53",
        "summary": "[RESOLVED] Change Propagation Delays & API Errors",
        "date": "1557512464",
        "status": 2,
        "details": "",
        "description": "<div><span class=\"yellowfg\">11:21 AM PDT</span>&nbsp;We are investigating increased propagation times of DNS edits to public and private Route 53 hosted zones, and increased failures for Delete Hosted Zone, Associate Private Hosted Zone and Disassociate Private Hosted Zone API and Console operations. Queries to existing DNS records are not affected by this issue.</div><div><span class=\"yellowfg\">11:28 AM PDT</span>&nbsp;We are investigating increased propagation times of DNS edits to public and private Route 53 hosted zones, and increased failures for Create Hosted Zone, Delete Hosted Zone, Associate Private Hosted Zone and Disassociate Private Hosted Zone API and Console operations. Queries to existing DNS records are not affected by this issue.</div><div><span class=\"yellowfg\">12:06 PM PDT</span>&nbsp;We continue to investigate increased propagation times of DNS edits to public and private Route 53 hosted zones, and increased failures for Create Hosted Zone, Delete Hosted Zone, Associate Private Hosted Zone and Disassociate Private Hosted Zone API and Console operations. Queries to existing DNS records are not affected by this issue.</div><div><span class=\"yellowfg\">12:35 PM PDT</span>&nbsp;We have identified the root cause and continue to work toward recovery. This may also impact provisioning workflows for other AWS services that use Route 53 for their DNS names. Queries to existing DNS records are not affected by this issue.</div><div><span class=\"yellowfg\"> 2:01 PM PDT</span>&nbsp;DNS updates are being accepted by the Route 53 API and Console, however an error is preventing the updates from being propagated from the Route53 API system to the live DNS servers. We have identified the root cause of this propagation error and are actively working towards resolution. This issue is impacting provisioning workflows for other AWS services that use Route 53 for their DNS names. Queries to DNS records present at the beginning of this issue are not affected and are being answered normally.</div><div><span class=\"yellowfg\"> 4:00 PM PDT</span>&nbsp;Some DNS changes are now propagating to the live DNS servers.  We continue to work towards full recovery.</div><div><span class=\"yellowfg\"> 5:18 PM PDT</span>&nbsp;We are observing steady recovery, with the oldest changes propagating first. We are continuing to work through the backlog of queued changes.</div><div><span class=\"yellowfg\"> 6:30 PM PDT</span>&nbsp;The backlog of queued changes continues to propagate. We have taken steps to accelerate recovery.</div><div><span class=\"yellowfg\"> 7:35 PM PDT</span>&nbsp;We have now propagated more than half of the backlog of queued changes and are continuing to work on the remainder.</div><div><span class=\"yellowfg\"> 8:23 PM PDT</span>&nbsp;We have processed the majority of the backlog of queued changes for Route 53 Public DNS. Private DNS changes are still experiencing propagation delays. Until we have fully recovered, customers may receive an error for the following APIs: CreateHostedZone, DeleteHostedZone, AssociateVPCWithHostedZone, and DisassociateVPCFromHostedZone. We continue to work towards full recovery.</div><div><span class=\"yellowfg\">10:08 PM PDT</span>&nbsp;As of 8:34 PM PDT, we have resolved the issue resulting in Route 53 Public DNS propagation delays. At this time, Route 53 Private DNS changes are still experiencing propagation delays. Until we have fully recovered, customers will continue to receive errors for the following APIs: CreateHostedZone, DeleteHostedZone, AssociateVPCWithHostedZone, and DisassociateVPCFromHostedZone.</div><div><span class=\"yellowfg\">11:51 PM PDT</span>&nbsp;We continue to make progress towards restoring propagation for Route 53 Private DNS changes and resolving increased API errors for CreateHostedZone, DeleteHostedZone, AssociateVPCWithHostedZone, and DisassociateVPCFromHostedZone Route 53 API calls. A majority of our hosts have processed all updates, and we are working to accelerate recovery of the remaining hosts.</div><div><span class=\"yellowfg\">May 11,  1:41 AM PDT</span>&nbsp;We have restored propagation for Route 53 Private DNS changes. We continue to work on resolving increased API errors for CreateHostedZone, DeleteHostedZone, AssociateVPCWithHostedZone, and DisassociateVPCFromHostedZone Route 53 API calls.</div><div><span class=\"yellowfg\">May 11,  2:39 AM PDT</span>&nbsp;Between May 10 10:50 AM and May 11 2:18 AM PDT we experienced increased change propagation latency and elevated error rates for CreateHostedZone, DeleteHostedZone, AssociateVPCWithHostedZone and DisassociateVPCFromHostedZone calls to the Route 53 API. During this entire duration there were no issues serving DNS queries. The issue has been resolved and the service is now operating normally.</div>",
        "service": "route53"
    }, {
        "service_name": "Amazon Route 53",
        "summary": "[RESOLVED] Change Propagation Delays & API Errors",
        "date": "1557569326",
        "status": 1,
        "details": "",
        "description": "<div><span class=\"yellowfg\">May 10, 11:21 AM PDT</span>&nbsp;We are investigating increased propagation times of DNS edits to public and private Route 53 hosted zones, and increased failures for Delete Hosted Zone, Associate Private Hosted Zone and Disassociate Private Hosted Zone API and Console operations. Queries to existing DNS records are not affected by this issue.</div><div><span class=\"yellowfg\">May 10, 11:28 AM PDT</span>&nbsp;We are investigating increased propagation times of DNS edits to public and private Route 53 hosted zones, and increased failures for Create Hosted Zone, Delete Hosted Zone, Associate Private Hosted Zone and Disassociate Private Hosted Zone API and Console operations. Queries to existing DNS records are not affected by this issue.</div><div><span class=\"yellowfg\">May 10, 12:06 PM PDT</span>&nbsp;We continue to investigate increased propagation times of DNS edits to public and private Route 53 hosted zones, and increased failures for Create Hosted Zone, Delete Hosted Zone, Associate Private Hosted Zone and Disassociate Private Hosted Zone API and Console operations. Queries to existing DNS records are not affected by this issue.</div><div><span class=\"yellowfg\">May 10, 12:35 PM PDT</span>&nbsp;We have identified the root cause and continue to work toward recovery. This may also impact provisioning workflows for other AWS services that use Route 53 for their DNS names. Queries to existing DNS records are not affected by this issue.</div><div><span class=\"yellowfg\">May 10,  2:01 PM PDT</span>&nbsp;DNS updates are being accepted by the Route 53 API and Console, however an error is preventing the updates from being propagated from the Route53 API system to the live DNS servers. We have identified the root cause of this propagation error and are actively working towards resolution. This issue is impacting provisioning workflows for other AWS services that use Route 53 for their DNS names. Queries to DNS records present at the beginning of this issue are not affected and are being answered normally.</div><div><span class=\"yellowfg\">May 10,  4:00 PM PDT</span>&nbsp;Some DNS changes are now propagating to the live DNS servers.  We continue to work towards full recovery.</div><div><span class=\"yellowfg\">May 10,  5:18 PM PDT</span>&nbsp;We are observing steady recovery, with the oldest changes propagating first. We are continuing to work through the backlog of queued changes.</div><div><span class=\"yellowfg\">May 10,  6:30 PM PDT</span>&nbsp;The backlog of queued changes continues to propagate. We have taken steps to accelerate recovery.</div><div><span class=\"yellowfg\">May 10,  7:35 PM PDT</span>&nbsp;We have now propagated more than half of the backlog of queued changes and are continuing to work on the remainder.</div><div><span class=\"yellowfg\">May 10,  8:23 PM PDT</span>&nbsp;We have processed the majority of the backlog of queued changes for Route 53 Public DNS. Private DNS changes are still experiencing propagation delays. Until we have fully recovered, customers may receive an error for the following APIs: CreateHostedZone, DeleteHostedZone, AssociateVPCWithHostedZone, and DisassociateVPCFromHostedZone. We continue to work towards full recovery.</div><div><span class=\"yellowfg\">May 10, 10:08 PM PDT</span>&nbsp;As of 8:34 PM PDT, we have resolved the issue resulting in Route 53 Public DNS propagation delays. At this time, Route 53 Private DNS changes are still experiencing propagation delays. Until we have fully recovered, customers will continue to receive errors for the following APIs: CreateHostedZone, DeleteHostedZone, AssociateVPCWithHostedZone, and DisassociateVPCFromHostedZone.</div><div><span class=\"yellowfg\">May 10, 11:51 PM PDT</span>&nbsp;We continue to make progress towards restoring propagation for Route 53 Private DNS changes and resolving increased API errors for CreateHostedZone, DeleteHostedZone, AssociateVPCWithHostedZone, and DisassociateVPCFromHostedZone Route 53 API calls. A majority of our hosts have processed all updates, and we are working to accelerate recovery of the remaining hosts.</div><div><span class=\"yellowfg\"> 1:41 AM PDT</span>&nbsp;We have restored propagation for Route 53 Private DNS changes. We continue to work on resolving increased API errors for CreateHostedZone, DeleteHostedZone, AssociateVPCWithHostedZone, and DisassociateVPCFromHostedZone Route 53 API calls.</div><div><span class=\"yellowfg\"> 2:39 AM PDT</span>&nbsp;Between May 10 10:50 AM and May 11 2:18 AM PDT we experienced increased change propagation latency and elevated error rates for CreateHostedZone, DeleteHostedZone, AssociateVPCWithHostedZone and DisassociateVPCFromHostedZone calls to the Route 53 API. During this entire duration there were no issues serving DNS queries. The issue has been resolved and the service is now operating normally.</div>",
        "service": "route53"
    }, {
        "service_name": "Amazon Connect (N. Virginia)",
        "summary": "[RESOLVED] Degraded Call Handling Experience",
        "date": "1558724798",
        "status": "1",
        "details": "",
        "description": "<div><span class=\"yellowfg\">12:06 PM PDT</span>&nbsp;Between 10:40 AM and 11:04 AM PDT we experienced failures in call handling operations in the US-EAST-1 Region. The issue has been resolved and the service is operating normally.</div>",
        "service": "connect-us-east-1"
    }, {
        "service_name": "Amazon Relational Database Service (N. Virginia)",
        "summary": "[RESOLVED] Increased API Latencies and Management Console Error Rates",
        "date": "1560790279",
        "status": "1",
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 9:51 AM PDT</span>&nbsp;We are investigating increased API latencies and increased error rates for the RDS Management Console in the US-EAST-1 Region.</div><div><span class=\"yellowfg\">10:09 AM PDT</span>&nbsp;Between 8:21 AM and 10:01 AM PDT, we experienced increased API latencies and increased error rates for the RDS Management Console in the US-EAST-1 Region. The issue has been resolved and the service is operating normally.</div>",
        "service": "rds-us-east-1"
    }, {
        "service_name": "Amazon Virtual Private Cloud (Singapore)",
        "summary": "[RESOLVED] AWS Site-to-Site VPN Connectivity Issues",
        "date": "1561413948",
        "status": "2",
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 3:05 PM PDT</span>&nbsp;We are investigating network connectivity issues affecting some AWS Site-to-Site VPN customers in the AP-SOUTHEAST-1 Region.</div><div><span class=\"yellowfg\"> 3:24 PM PDT</span>&nbsp;We have identified the root cause of the issue affecting network connectivity for some AWS Site-to-Site VPN connections within the AP-SOUTHEAST-1 Region. Connectivity to and from the Internet, within Amazon VPC, and over DirectConnect is not affected by this issue.</div><div><span class=\"yellowfg\"> 4:11 PM PDT</span>&nbsp;We can confirm network connectivity issues for some AWS Site-to-Site VPN connections within the AP-SOUTHEAST-1 Region and continue to work towards resolution. Connectivity to and from the Internet, within Amazon VPC, and over DirectConnect is not affected by this issue.</div><div><span class=\"yellowfg\"> 4:37 PM PDT</span>&nbsp;We can confirm network connectivity issues for existing AWS Site-to-Site VPN connections within the AP-SOUTHEAST-1 Region and are starting to see recovery. Newly created AWS Site-to-Site VPN connections within the AP-SOUTHEAST-1 Region are not affected by this issue. Connectivity to and from the Internet, within Amazon VPC, and over DirectConnect is not affected by this issue.</div><div><span class=\"yellowfg\"> 5:52 PM PDT</span>&nbsp;We continue to work towards full recovery of the network connectivity issues affecting VPN connections in the AP-SOUTHEAST-1 Region. Connectivity to and from the Internet, within Amazon VPC, and over DirectConnect is not affected by this issue.</div><div><span class=\"yellowfg\"> 7:07 PM PDT</span>&nbsp;We continue to work towards full recovery of the network connectivity issues affecting VPN connections in the AP-SOUTHEAST-1 Region. Connectivity to and from the Internet, within Amazon VPC, and over DirectConnect is not affected by this issue.</div><div><span class=\"yellowfg\"> 9:08 PM PDT</span>&nbsp;Some VPN connections have been restored. We continue to work towards full recovery.</div><div><span class=\"yellowfg\"> 9:54 PM PDT</span>&nbsp;We have now restored connectivity for the majority of the primary tunnels associated with all affected VPN connections in the AP-SOUTHEAST-1 Region. At this stage, VPN connections should no longer be experiencing connectivity issues. We continue to work on restoring connectivity for all secondary tunnels.</div><div><span class=\"yellowfg\">10:35 PM PDT</span>&nbsp;While the majority of VPN tunnels are once again able to establish a connection, route updates are not yet propagating for all affected VPN connections in the AP-SOUTHEAST-1 Region. For affected tunnels, this will result in network connectivity issues which we continue to work on resolving. </div><div><span class=\"yellowfg\">Jun 25,  1:34 AM PDT</span>&nbsp;We continue to make progress in restoring network connectivity for VPN connections in the AP-SOUTHEAST-1 Region. We are also seeing an improvement in route propagation times as we work towards full recovery.</div><div><span class=\"yellowfg\">Jun 25,  6:32 AM PDT</span>&nbsp;We have resolved the connectivity issues affecting VPN connections in the AP-SOUTHEAST-1 Region. Connectivity to and from the Internet, within Amazon VPC, and over DirectConnect was not affected by this issue. The issue has been resolved and the service is operating normally.</div>",
        "service": "vpc-ap-southeast-1"
    }, {
        "service_name": "AWS IoT Analytics (N. Virginia)",
        "summary": "[RESOLVED] Increased API Error Rates and Latency",
        "date": "1561652460",
        "status": "2",
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 1:32 PM PDT</span>&nbsp;We can confirm increased error rates and latencies in the US-EAST-1 Region. We have identified the root cause and continue to work toward resolution.</div><div><span class=\"yellowfg\"> 2:33 PM PDT</span>&nbsp;We are seeing significant recovery and continue to work on restoring all operations.</div><div><span class=\"yellowfg\"> 2:45 PM PDT</span>&nbsp;Between 9:21 AM and 2:27 PM PDT we experienced increased API error rates and latencies in the US-EAST-1 Region. The issue has been resolved and the service is operating normally.</div>",
        "service": "iotanalytics-us-east-1"
    }, {
        "service_name": "AWS Glue (N. Virginia)",
        "summary": "[RESOLVED] Increased Error Rates",
        "date": "1561655416",
        "status": "3",
        "details": "",
        "description": "<div><span class=\"yellowfg\">10:10 AM PDT</span>&nbsp;We are investigating increased API error rates in the US-EAST-1 Region.</div><div><span class=\"yellowfg\">10:34 AM PDT</span>&nbsp;We can confirm increased API error rates in the US-EAST-1 Region. We have identified the root cause and continue to work toward resolution. </div><div><span class=\"yellowfg\">11:52 AM PDT</span>&nbsp;We are beginning to see intermittent recovery for Glue and continue to work toward full recovery.</div><div><span class=\"yellowfg\"> 1:04 PM PDT</span>&nbsp;We want to give you more information on the issue affecting AWS Glue. Glue Workflow APIs, Orchestration APIs, and ETL jobs that do not require the AWS Glue Data Catalog APIs continue to operate normally. The issue with the Data Catalog APIs started with a software update in the US-EAST-1 Region that completed at 9:21 AM PDT. The software update was immediately rolled back, and we are now working towards stabilizing the Data Catalog API subsystem. We continue to work towards a full recovery.</div><div><span class=\"yellowfg\"> 1:17 PM PDT</span>&nbsp;As we work toward resolution we are temporarily suspending traffic for the Data Catalog APIs in the US-EAST-1 Region.</div><div><span class=\"yellowfg\"> 2:06 PM PDT</span>&nbsp;We are beginning to work on removing throttles and restoring API availability but are proceeding cautiously.</div><div><span class=\"yellowfg\"> 2:23 PM PDT</span>&nbsp;We are seeing significant recovery and continue to work on restoring all operations.</div><div><span class=\"yellowfg\"> 2:42 PM PDT</span>&nbsp;Between 9:21 AM and 2:06 PM PDT we experienced increased API error rates in the US-EAST-1 Region. The issue has been resolved and the service is operating normally.</div>",
        "service": "glue-us-east-1"
    }, {
        "service_name": "Amazon Athena (N. Virginia)",
        "summary": "[RESOLVED] Increased Query Failures and Latency",
        "date": "1561655746",
        "status": "3",
        "details": "",
        "description": "<div><span class=\"yellowfg\">10:15 AM PDT</span>&nbsp;We are investigating increased query failures and latency in the US-EAST-1 Region.</div><div><span class=\"yellowfg\">10:37 AM PDT</span>&nbsp;We can confirm increased query failures and latency in the US-EAST-1 Region.</div><div><span class=\"yellowfg\">11:01 AM PDT</span>&nbsp;We have identified the root cause and continue to work toward resolution.</div><div><span class=\"yellowfg\">11:52 AM PDT</span>&nbsp;We are beginning to see signs of recovery for Athena and continue to work toward full recovery.</div><div><span class=\"yellowfg\">12:32 PM PDT</span>&nbsp;We continue to experience increased error rates, as Athena depends on the Glue Data Catalog APIs. We will be throttling the Athena APIs as we work toward recovery. Customers may receive a \"Rate Exceeded\" error as recovery progresses.</div><div><span class=\"yellowfg\"> 1:35 PM PDT</span>&nbsp;We continue to work toward resolution.</div><div><span class=\"yellowfg\"> 2:14 PM PDT</span>&nbsp;We are beginning to work on removing throttles and restoring query availability but are proceeding cautiously.</div><div><span class=\"yellowfg\"> 2:32 PM PDT</span>&nbsp;We are seeing significant recovery and continue to work on restoring all operations.</div><div><span class=\"yellowfg\"> 2:43 PM PDT</span>&nbsp;Between 9:21 AM and 2:36 PM PDT we experienced increased query failures and latency in the US-EAST-1 Region. The issue has been resolved and the service is operating normally.</div>",
        "service": "athena-us-east-1"
    }, {
        "service_name": "Amazon Redshift (N. Virginia)",
        "summary": "[RESOLVED] Increased API Error Rates",
        "date": "1561658605",
        "status": "1",
        "details": "",
        "description": "<div><span class=\"yellowfg\">11:03 AM PDT</span>&nbsp;We are investigating increased error rates for Redshift Spectrum queries accessing the Glue catalog in the US-EAST-1 Region.</div><div><span class=\"yellowfg\">12:04 PM PDT</span>&nbsp;We can confirm increased error rates for Redshift Spectrum queries accessing the Glue catalog in the US-EAST-1 Region. We have identified the root cause and continue to work toward resolution.</div><div><span class=\"yellowfg\"> 1:09 PM PDT</span>&nbsp;We continue to work toward resolution.</div><div><span class=\"yellowfg\"> 2:33 PM PDT</span>&nbsp;We are seeing significant recovery and continue to work on restoring all operations.</div><div><span class=\"yellowfg\"> 2:45 PM PDT</span>&nbsp;Between 9:21 AM and 2:06 PM PDT we experienced increased error rates for Redshift Spectrum queries accessing the Glue catalog in the US-EAST-1 Region. The issue has been resolved and the service is operating normally. </div>",
        "service": "redshift-us-east-1"
    }, {
        "service_name": "Amazon Elastic Compute Cloud (London)",
        "summary": "[RESOLVED] Increased API Error Rates",
        "date": "1561864621",
        "status": "1",
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 8:17 PM PDT</span>&nbsp;We are investigating increased API error rates and latencies in a single Availability Zone in the EU-WEST-2 Region.</div><div><span class=\"yellowfg\"> 9:23 PM PDT</span>&nbsp;We continue to investigate the increased error rates and latencies for the EC2 APIs in the EU-WEST-2 Region. The health of existing EC2 instances is not affected.</div><div><span class=\"yellowfg\">10:00 PM PDT</span>&nbsp;Between 7:40 PM and 9:35 PM PDT we experienced increased API error rates and latencies in the EU-WEST-2 Region. The issue has been resolved and the service is operating normally.</div>",
        "service": "ec2-eu-west-2"
    }, {
        "service_name": "Amazon Elastic Load Balancing (London)",
        "summary": "[RESOLVED] Increased API Error Rates",
        "date": "1561866166",
        "status": "1",
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 8:42 PM PDT</span>&nbsp;We are investigating increased API error rates and latencies in the EU-WEST-2 Region.</div><div><span class=\"yellowfg\"> 9:51 PM PDT</span>&nbsp;We have identified the root cause of the increase in error rates and latencies for the ELB APIs in the EU-WEST-2 Region and continue to work towards full recovery.</div><div><span class=\"yellowfg\">10:45 PM PDT</span>&nbsp;Between 8:25 PM and 10:15 PM PDT, we experienced increased API error rates and latencies in the EU-WEST-2 Region. The issue has been resolved and the service is operating normally.</div>",
        "service": "elb-eu-west-2"
    }, {
        "service_name": "Amazon CloudWatch (London)",
        "summary": "[RESOLVED] Elevated API faults and alarm delays",
        "date": "1561867337",
        "status": "1",
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 9:02 PM PDT</span>&nbsp;We are investigating increased faults for CloudWatch alarms APIs and delays in processing some alarms in the EU-WEST-2 Region.</div><div><span class=\"yellowfg\"> 9:55 PM PDT</span>&nbsp;We can confirm an elevated rate of CloudWatch Alarms API faults and delays in processing some alarms in EU-WEST-2 Region and continue to work towards full recovery.</div><div><span class=\"yellowfg\">10:04 PM PDT</span>&nbsp;Between 8:27 PM and 9:55 PM PDT, customers may have experienced elevated alarms API faults and delayed alarms in the EU-WEST-2 Region. We have resolved the issue and the service is operating normally.</div>",
        "service": "cloudwatch-eu-west-2"
    }, {
        "service_name": "Amazon Simple Workflow Service (London)",
        "summary": "[RESOLVED] Elevated error rates for Simple Workflow",
        "date": "1561871879",
        "status": "1",
        "details": "",
        "description": "<div><span class=\"yellowfg\">10:18 PM PDT</span>&nbsp;We are experiencing elevated API failures for AWS Simple Workflow in the EU-WEST-2 Region and continue to work towards full recovery.</div><div><span class=\"yellowfg\">10:55 PM PDT</span>&nbsp;Between 9:15 PM and 10:30 PM PDT we experienced elevated API failures for AWS Simple Workflow in the EU-WEST-2 Region. The issue has been resolved and the service is operating normally.</div>",
        "service": "swf-eu-west-2"
    }, {
        "service_name": "Amazon Elastic Compute Cloud (US-East)",
        "summary": "[RESOLVED] Increased API Error Rates",
        "date": "1562900564",
        "status": "1",
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 8:02 PM PDT</span>&nbsp;We are investigating increased error rates for the EC2 APIs and new instance launches in the US-GOV-EAST-1 Region. Existing instances are unaffected. </div><div><span class=\"yellowfg\"> 8:35 PM PDT</span>&nbsp;We can confirm increased error rates for the CreateVolume and CreateSnapshot EBS APIs in the US-GOV-EAST-1 Region. This may impact the launching of new EBS backed EC2 instances. Existing instances are unaffected. </div><div><span class=\"yellowfg\"> 9:00 PM PDT</span>&nbsp;Between 7:07 PM and 8:47 PM PDT we experienced increased error rates for the CreateVolume and CreateSnapshot EBS APIs in the US-GOV-EAST-1 Region, which also impacted the launching of new EBS backed EC2 instances. Existing instances were unaffected. The issue has been resolved and the service is operating normally.</div>",
        "service": "ec2-us-gov-east-1"
    }, {
        "service_name": "Amazon Elastic Compute Cloud (London)",
        "summary": "[RESOLVED] EBS Volumes Degraded Performance",
        "date": "1563902591",
        "status": "1",
        "details": "",
        "description": "<div><span class=\"yellowfg\">10:23 AM PDT</span>&nbsp;We are investigating degraded performance for EBS volumes in a single Availability Zone in the EU-WEST-2 Region.</div><div><span class=\"yellowfg\">11:11 AM PDT</span>&nbsp;We have determined root cause of the degraded performance for EBS volumes in a single Availability Zone in the EU-WEST-2 Region. The degraded performance has been resolved for some of the affected volumes and we continue to work towards full recovery.</div><div><span class=\"yellowfg\">11:44 AM PDT</span>&nbsp;Between 9:30 AM and 11:37 AM PDT we experienced degraded performance for some EBS volumes in a single Availability Zone in the EU-WEST-2 Region. The issue has been resolved and the service is operating normally.</div>",
        "service": "ec2-eu-west-2"
    }, {
        "service_name": "Amazon Relational Database Service (London)",
        "summary": "[RESOLVED] Connectivity Issues",
        "date": "1563904324",
        "status": "1",
        "details": "",
        "description": "<div><span class=\"yellowfg\">10:52 AM PDT</span>&nbsp;We are investigating connectivity issues affecting some database instances in a single Availability Zone in the EU-WEST-2 Region.</div><div><span class=\"yellowfg\">11:26 AM PDT</span>&nbsp;We have determined root cause for the connectivity issues affecting some database instances in a single Availability Zone in the EU-WEST-2 Region. The connectivity issues have been resolved for some database instances and we continue to work towards full recovery.</div><div><span class=\"yellowfg\">11:51 AM PDT</span>&nbsp;Between 9:30 AM and 11:40 AM PDT we experienced connectivity issues affecting some database instances in a single Availability Zone in the EU-WEST-2 Region. The issue has been resolved and the service is operating normally.</div>",
        "service": "rds-eu-west-2"
    }, {
        "service_name": "Amazon Connect (N. Virginia)",
        "summary": "[RESOLVED] Increased Call Failures",
        "date": "1566235755",
        "status": "2",
        "details": "",
        "description": "<div><span class=\"yellowfg\">10:29 AM PDT</span>&nbsp;We are investigating call failures and issues accessing Amazon Connect in the US-EAST-1 Region.</div><div><span class=\"yellowfg\">10:58 AM PDT</span>&nbsp;Call handling has recovered for agents who can access Amazon Connect in the US-EAST-1 Region. We continue to investigate problems accessing the Amazon Connect Console.</div><div><span class=\"yellowfg\">11:46 AM PDT</span>&nbsp;Between 10:02 AM and 11:13 AM PDT, some Amazon Connect users experienced issues logging in or performing actions in the Connect application in the US-EAST-1 Region. Some calls may have failed during this time. The issue has been resolved and the service is operating normally.</div>",
        "service": "connect-us-east-1"
    }, {
        "service_name": "Amazon Elastic Compute Cloud (N. Virginia)",
        "summary": "[RESOLVED] Increased API Error Rates and Latencies ",
        "date": "1566264383",
        "status": "1",
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 6:26 PM PDT</span>&nbsp;We are investigating increased API error rates and latencies for the EC2 APIs in the US-EAST-1 Region.</div><div><span class=\"yellowfg\"> 6:48 PM PDT</span>&nbsp;Between 6:00 PM and 6:41 PM PDT we experienced increased API error rates and latencies for the EC2 APIs in the US-EAST-1 Region. The issue has been resolved and the service is operating normally.</div>",
        "service": "ec2-us-east-1"
    }, {
        "service_name": "Amazon Elastic Compute Cloud (Tokyo)",
        "summary": "ã‚¤ãƒ³ã‚¹ã‚¿ãƒ³ã‚¹ã®æŽ¥ç¶šæ€§ã«ã¤ã„ã¦ | Instance Availability",
        "date": "1566533746",
        "status": "2",
        "details": "",
        "description": "<div><span class=\"yellowfg\"> 9:18 PM PDT</span>&nbsp;We are investigating connectivity issues affecting some instances in a single Availability Zone in the AP-NORTHEAST-1 Region.</div><div><span class=\"yellowfg\"> 9:47 PM PDT</span>&nbsp;We can confirm that some instances are impaired and some EBS volumes are experiencing degraded performance within a single Availability Zone in the AP-NORTHEAST-1 Region. Some EC2 APIs are also experiencing increased error rates and latencies. We are working to resolve the issue.</div><div><span class=\"yellowfg\">10:27 PM PDT</span>&nbsp;We have identified the root cause and are working toward recovery for the instance impairments and degraded EBS volume performance within a single Availability Zone in the AP-NORTHEAST-1 Region.</div><div><span class=\"yellowfg\">11:40 PM PDT</span>&nbsp;We are starting to see recovery for instance impairments and degraded EBS volume performance within a single Availability Zone in the AP-NORTHEAST-1 Region. We continue to work towards recovery for all affected instances and EBS volumes.</div><div><span class=\"yellowfg\">Aug 23,  1:54 AM PDT</span>&nbsp;Recovery is in progress for instance impairments and degraded EBS volume performance within a single Availability Zone in the AP-NORTHEAST-1 Region. We continue to work towards recovery for all affected instances and EBS volumes.</div><div><span class=\"yellowfg\">Aug 23,  2:39 AM PDT</span>&nbsp;The majority of impaired EC2 instances and EBS volumes experiencing degraded performance have now recovered. We continue to work on recovery for the remaining EC2 instances and EBS volumes that are affected by this issue. This issue affects EC2 instances and EBS volumes in a single Availability Zone in the AP-NORTHEAST-1 region.</div><div><span class=\"yellowfg\">Aug 23,  4:18 AM PDT</span>&nbsp;æ—¥æœ¬æ™‚é–“ 2019å¹´8æœˆ23æ—¥ 12:36 ã‚ˆã‚Šã€AP-NORTHEAST-1 ã®å˜ä¸€ã®ã‚¢ãƒ™ã‚¤ãƒ©ãƒ“ãƒªãƒ†ã‚£ã‚¾ãƒ¼ãƒ³ã§ã€ä¸€å®šã®å‰²åˆã® EC2 ã‚µãƒ¼ãƒã®ã‚ªãƒ¼ãƒãƒ¼ãƒ’ãƒ¼ãƒˆãŒç™ºç”Ÿã—ã¾ã—ãŸã€‚ã“ã®çµæžœã€å½“è©²ã‚¢ãƒ™ã‚¤ãƒ©ãƒ“ãƒªãƒ†ã‚£ã‚¾ãƒ¼ãƒ³ã® EC2 ã‚¤ãƒ³ã‚¹ã‚¿ãƒ³ã‚¹åŠã³ EBS ãƒœãƒªãƒ¥ãƒ¼ãƒ ã®ãƒ‘ãƒ•ã‚©ãƒ¼ãƒžãƒ³ã‚¹ã®åŠ£åŒ–ãŒç™ºç”Ÿã—ã¾ã—ãŸã€‚ã“ã®ã‚ªãƒ¼ãƒãƒ¼ãƒ’ãƒ¼ãƒˆã¯ã€å½±éŸ¿ã‚’å—ã‘ãŸã‚¢ãƒ™ã‚¤ãƒ©ãƒ“ãƒªãƒ†ã‚£ã‚¾ãƒ¼ãƒ³ä¸­ã®ä¸€éƒ¨ã®å†—é•·åŒ–ã•ã‚ŒãŸç©ºèª¿è¨­å‚™ã®ç®¡ç†ã‚·ã‚¹ãƒ†ãƒ éšœå®³ãŒåŽŸå› ã§ã™ã€‚æ—¥æœ¬æ™‚é–“ 15:21 ã«å†·å´è£…ç½®ã¯å¾©æ—§ã—ã€å®¤æ¸©ãŒé€šå¸¸çŠ¶æ…‹ã«æˆ»ã‚Šå§‹ã‚ã¾ã—ãŸã€‚æ¸©åº¦ãŒé€šå¸¸çŠ¶æ…‹ã«æˆ»ã£ãŸã“ã¨ã§ã€å½±éŸ¿ã‚’å—ã‘ãŸã‚¤ãƒ³ã‚¹ã‚¿ãƒ³ã‚¹ã®é›»æºãŒå›žå¾©ã—ã¾ã—ãŸã€‚æ—¥æœ¬æ™‚é–“ 18:30 ã‚ˆã‚Šå¤§éƒ¨åˆ†ã® EC2 ã‚¤ãƒ³ã‚¹ã‚¿ãƒ³ã‚¹ã¨ EBS ãƒœãƒªãƒ¥ãƒ¼ãƒ ã¯å›žå¾©ã—ã¾ã—ãŸã€‚ æˆ‘ã€…ã¯æ®‹ã‚Šã® EC2 ã‚¤ãƒ³ã‚¹ã‚¿ãƒ³ã‚¹ã¨ EBS ãƒœãƒªãƒ¥ãƒ¼ãƒ ã®å›žå¾©ã«å–ã‚Šçµ„ã‚“ã§ã„ã¾ã™ã€‚å°‘æ•°ã® EC2 ã‚¤ãƒ³ã‚¹ã‚¿ãƒ³ã‚¹ã¨ EBS ãƒœãƒªãƒ¥ãƒ¼ãƒ ãŒé›»æºãŒè½ã¡ãŸãƒãƒ¼ãƒ‰ã‚¦ã‚§ã‚¢ ãƒ›ã‚¹ãƒˆä¸Šã«æ®‹ã•ã‚Œã¦ã„ã¾ã™ã€‚æˆ‘ã€…ã¯å½±éŸ¿ã‚’ã†ã‘ãŸå…¨ã¦ã® EC2 ã‚¤ãƒ³ã‚¹ã‚¿ãƒ³ã‚¹ã¨ EBS ãƒœãƒªãƒ¥ãƒ¼ãƒ ã®å›žå¾©ã®ãŸã‚ã®ä½œæ¥­ã‚’ç¶™ç¶šã—ã¦ã„ã¾ã™ã€‚ æ—©æœŸå›žå¾©ã®ç‚ºã€å¯èƒ½ãªå ´åˆæ®‹ã•ã‚ŒãŸå½±éŸ¿ã‚’å—ã‘ã¦ã„ã‚‹ EC2 ã‚¤ãƒ³ã‚¹ã‚¿ãƒ³ã‚¹ã¨ EBS ãƒœãƒªãƒ¥ãƒ¼ãƒ ã®ãƒªãƒ—ãƒ¬ãƒ¼ã‚¹ã‚’æŽ¨å¥¨ã—ã¾ã™ã€‚ã„ãã¤ã‹ã®å½±éŸ¿ã‚’ã†ã‘ãŸ EC2 ã‚¤ãƒ³ã‚¹ã‚¿ãƒ³ã‚¹ã¯ãŠå®¢æ§˜å´ã§ã®ä½œæ¥­ãŒå¿…è¦ã«ãªã‚‹å¯èƒ½æ€§ãŒã‚ã‚‹ç‚ºã€ å¾Œã»ã©ãŠå®¢æ§˜å€‹åˆ¥ã«ãŠçŸ¥ã‚‰ã›ã™ã‚‹ã“ã¨ã‚’äºˆå®šã—ã¦ã„ã¾ã™ã€‚<br><br>è©³ç´°ã¯ <a href=\"https://aws.amazon.com/message/56489/\">ã“ã¡ã‚‰</a> ã‚’ã”å‚ç…§ãã ã•ã„ã€‚è¿½åŠ ã®ã”è³ªå•ãŒã‚ã‚‹å ´åˆã¯ã€<a href=\"https://aws.amazon.com/support\">AWS ã‚µãƒãƒ¼ãƒˆ</a>ã¾ã§ã”é€£çµ¡ãã ã•ã„ã€‚ | Beginning at 8:36 PM PDT a small percentage of EC2 servers in a single Availability Zone in the AP-NORTHEAST-1 Region shutdown due to overheating. This resulted in impaired EC2 instances and degraded EBS volume performance for resources in the affected area of the Availability Zone. The overheating was caused by a control system failure that caused multiple, redundant cooling systems to fail in parts of the affected Availability Zone. The chillers were restored at 11:21 PM PDT and temperatures in the affected areas began to return to normal. As temperatures returned to normal, power was restored to the affected instances. By 2:30 AM PDT, the vast majority of instances and volumes had recovered. We have been working to recover the remaining instances and volumes. A small number of remaining instances and volumes are hosted on hardware which was adversely affected by the loss of power. We continue to work to recover all affected instances and volumes. For immediate recovery, we recommend replacing any remaining affected instances or volumes if possible. Some of the affected instances may require action from customers and we will be reaching out to those customers with next steps.<br><br>Additional details are available <a href=\"https://aws.amazon.com/message/56489/\">here</a>. If you have additional questions, please contact <a href=\"https://aws.amazon.com/support\">AWS Support</a>.</div>",
        "service": "ec2-ap-northeast-1"
    }, {
        "service_name": "Amazon Relational Database Service (Tokyo)",
        "summary": "ã‚¤ãƒ³ã‚¹ã‚¿ãƒ³ã‚¹ã®æŽ¥ç¶šæ€§ã«ã¤ã„ã¦ | Instance Availability",
        "date": "1566537770",
        "status": "1",
        "details": "",
        "description": "<div><span class=\"yellowfg\">10:22 PM PDT</span>&nbsp;AWSã§ã¯ã€ç¾åœ¨ã€æ±äº¬ãƒªãƒ¼ã‚¸ãƒ§ãƒ³ã®1ã¤ã®ã‚¢ãƒ™ã‚¤ãƒ©ãƒ“ãƒªãƒ†ã‚£ã‚¾ãƒ¼ãƒ³ã§ç™ºç”Ÿã—ã¦ã„ã‚‹ã€è¤‡æ•°ã‚¤ãƒ³ã‚¹ã‚¿ãƒ³ã‚¹ã«å¯¾ã™ã‚‹æŽ¥ç¶šæ€§ã®å•é¡Œã«ã¤ã„ã¦èª¿æŸ»ã‚’é€²ã‚ã¦ãŠã‚Šã¾ã™ã€‚| We are investigating connectivity issues affecting some instances in a single Availability Zone in the AP-NORTHEAST-1 Region.</div><div><span class=\"yellowfg\">11:25 PM PDT</span>&nbsp;AWSã§ã¯ã€æ±äº¬ãƒªãƒ¼ã‚¸ãƒ§ãƒ³ã®1ã¤ã®ã‚¢ãƒ™ã‚¤ãƒ©ãƒ“ãƒªãƒ†ã‚£ã‚¾ãƒ¼ãƒ³ã§ç™ºç”Ÿã—ã¦ã„ã‚‹ã‚¤ãƒ³ã‚¹ã‚¿ãƒ³ã‚¹ã®æŽ¥ç¶šæ€§ã®å•é¡Œã«ã¤ã„ã¦åŽŸå› ã‚’ç‰¹å®šã—ã€ç¾åœ¨å¾©æ—§ã«å‘ã‘ã¦å¯¾å¿œã‚’é€²ã‚ã¦ãŠã‚Šã¾ã™ã€‚| We have identified the root cause of instance connectivity issues within a single Availability Zone in the AP-NORTHEAST-1 Region and are working toward recovery.</div><div><span class=\"yellowfg\">Aug 23, 12:01 AM PDT</span>&nbsp;AWSã§ã¯ã€ç¾åœ¨ã€æ±äº¬ãƒªãƒ¼ã‚¸ãƒ§ãƒ³ã®1ã¤ã®ã‚¢ãƒ™ã‚¤ãƒ©ãƒ“ãƒªãƒ†ã‚£ã‚¾ãƒ¼ãƒ³ã§ç™ºç”Ÿã—ã¦ã„ã‚‹ã‚¤ãƒ³ã‚¹ã‚¿ãƒ³ã‚¹ã®æŽ¥ç¶šæ€§ã®å•é¡Œã¤ã„ã¦ã€å¾©æ—§ã‚’é–‹å§‹ã—ã¦ãŠã‚Šã¾ã™ã€‚å½±éŸ¿ã‚’å—ã‘ã¦ã„ã‚‹å…¨ã¦ã®ã‚¤ãƒ³ã‚¹ã‚¿ãƒ³ã‚¹ã®å¾©æ—§ã«å‘ã‘ã€å¯¾å¿œã‚’ç¶™ç¶šã„ãŸã—ã¾ã™ã€‚| We are starting to see recovery for instance connectivity issues within a single Availability Zone in the AP-NORTHEAST-1 Region. We continue to work towards recovery for all affected instances.</div><div><span class=\"yellowfg\">Aug 23,  2:16 AM PDT</span>&nbsp;AWSã§ã¯ã€ç¾åœ¨ã€æ±äº¬ãƒªãƒ¼ã‚¸ãƒ§ãƒ³ã®1ã¤ã®ã‚¢ãƒ™ã‚¤ãƒ©ãƒ“ãƒªãƒ†ã‚£ã‚¾ãƒ¼ãƒ³ã§æŽ¥ç¶šæ€§ã®å•é¡ŒãŒç”Ÿã˜ã¦ã„ã‚‹å…¨ã¦ã®ã‚¤ãƒ³ã‚¹ã‚¿ãƒ³ã‚¹ã®å¾©æ—§ã«å‘ã‘ã€å¯¾å¿œã‚’é€²ã‚ã¦ãŠã‚Šã¾ã™ã€‚| We continue to see recovery for instance connectivity issues within a single Availability Zone in the AP-NORTHEAST-1 Region and are working towards recovery for all affected instances.</div><div><span class=\"yellowfg\">Aug 23,  6:19 AM PDT</span>&nbsp;æ—¥æœ¬æ™‚é–“ 2019å¹´8æœˆ23æ—¥ 12:36 ã‹ã‚‰ 22:05 ã«ã‹ã‘ã¦ã€æ±äº¬ãƒªãƒ¼ã‚¸ãƒ§ãƒ³ã®å˜ä¸€ã®ã‚¢ãƒ™ã‚¤ãƒ©ãƒ“ãƒªãƒ†ã‚£ã‚¾ãƒ¼ãƒ³ã§ä¸€éƒ¨ã® RDS ã‚¤ãƒ³ã‚¹ã‚¿ãƒ³ã‚¹ã«æŽ¥ç¶šæ€§ã®å•é¡ŒãŒç™ºç”Ÿã—ã¾ã—ãŸã€‚ç¾åœ¨ã€ã“ã®å•é¡Œã¯è§£æ¶ˆã—ã¦ãŠã‚Šã€ã‚µãƒ¼ãƒ“ã‚¹ã¯æ­£å¸¸ç¨¼åƒã—ã¦ãŠã‚Šã¾ã™ã€‚<br><br>è©³ç´°ã¯ <a href=\"https://aws.amazon.com/message/56489/\">ã“ã¡ã‚‰</a> ã‚’ã”å‚ç…§ãã ã•ã„ã€‚è¿½åŠ ã®ã”è³ªå•ãŒã‚ã‚‹å ´åˆã¯ã€<a href=\"https://aws.amazon.com/support\">AWS ã‚µãƒãƒ¼ãƒˆ</a>ã¾ã§ã”é€£çµ¡ãã ã•ã„ã€‚| Between August 22 8:36 PM and August 23 6:05 AM PDT, some RDS instances experienced connectivity issues within a single Availability Zone in the AP-NORTHEAST-1 Region. The issue has been resolved and the service is operating normally. <br><br>Additional details are available <a href=\"https://aws.amazon.com/message/56489/\">here</a>. If you have additional questions, please contact <a href=\"https://aws.amazon.com/support\">AWS Support</a>.</div>",
        "service": "rds-ap-northeast-1"
    }],
    "current": []
} >